99percentpeople/esp32qjs/components/esp32_mquickjs/src/core/mqjs_stdlib_esp32.c
#include <math.h>
#include <stdio.h>
#include <string.h>

#include "mquickjs_build.h"
#include "esp32_mquickjs_wifi_mesh_feature.h"

#define JS_CLASS_HEADERS (JS_CLASS_USER + 0)
#define JS_CLASS_REQUEST (JS_CLASS_USER + 1)
#define JS_CLASS_RESPONSE (JS_CLASS_USER + 2)
#define JS_CLASS_STREAM (JS_CLASS_USER + 4)
#define JS_CLASS_HTTP_SERVER (JS_CLASS_USER + 5)
#define JS_CLASS_I2C_BUS (JS_CLASS_USER + 7)
#define JS_CLASS_I2C_DEVICE (JS_CLASS_USER + 25)
#define JS_CLASS_SPI_BUS (JS_CLASS_USER + 8)
#define JS_CLASS_SPI_DEVICE (JS_CLASS_USER + 9)
#define JS_CLASS_UART_PORT (JS_CLASS_USER + 10)
#define JS_CLASS_BYTE_VIEW (JS_CLASS_USER + 11)
#define JS_CLASS_BYTE_SPAN_SOURCE (JS_CLASS_USER + 12)
#define JS_CLASS_BITMAP_SPAN_SOURCE (JS_CLASS_USER + 13)
#define JS_CLASS_BITMAP (JS_CLASS_USER + 14)
#define JS_CLASS_DISPLAY_FONT (JS_CLASS_USER + 15)
#define JS_CLASS_DISPLAY_COMMAND_BUFFER (JS_CLASS_USER + 16)
#define JS_CLASS_FUTURE (JS_CLASS_USER + 17)
#define JS_CLASS_EVENT_QUEUE (JS_CLASS_USER + 18)
#define JS_CLASS_I2S_CHANNEL (JS_CLASS_USER + 19)
#define JS_CLASS_CAMERA (JS_CLASS_USER + 20)
#define JS_CLASS_CAMERA_FRAME (JS_CLASS_USER + 21)
#define JS_CLASS_RMT_SYMBOL_BUFFER (JS_CLASS_USER + 22)
#define JS_CLASS_RMT_CHANNEL (JS_CLASS_USER + 23)
#define JS_CLASS_TCP_SOCKET (JS_CLASS_USER + 26)
#define JS_CLASS_TCP_LISTENER (JS_CLASS_USER + 27)
#define JS_CLASS_UDP_SOCKET (JS_CLASS_USER + 28)
#define JS_CLASS_RPC_CODEC (JS_CLASS_USER + 29)
#define JS_CLASS_RPC_DECODER (JS_CLASS_USER + 30)
#define JS_CLASS_BLE_ADAPTER (JS_CLASS_USER + 31)
#define JS_CLASS_BLE_SCANNER (JS_CLASS_USER + 32)
#define JS_CLASS_BLE_ADVERTISER (JS_CLASS_USER + 33)
#define JS_CLASS_BLE_CONNECTION (JS_CLASS_USER + 34)
#define JS_CLASS_BLE_NOTIFICATION_STREAM (JS_CLASS_USER + 35)
#define JS_CLASS_BLE_GATT_SERVER (JS_CLASS_USER + 36)
#define JS_CLASS_BLE_LOCAL_CHARACTERISTIC (JS_CLASS_USER + 37)
#define JS_CLASS_ESPNOW_SESSION (JS_CLASS_USER + 38)
#define JS_CLASS_ESPNOW_PEER (JS_CLASS_USER + 39)
#define JS_CLASS_USB_SERIAL_HANDLE (JS_CLASS_USER + 40)
#define JS_CLASS_WEBSOCKET_CLIENT_HANDLE (JS_CLASS_USER + 41)
#define JS_CLASS_WIFI_CSI_SESSION (JS_CLASS_USER + 42)
#define JS_CLASS_WIFI_CSI_FRAME (JS_CLASS_USER + 43)
#define JS_CLASS_WIFI_CSI_BATCH (JS_CLASS_USER + 44)
#define JS_CLASS_WIFI_WAKE_LOCK (JS_CLASS_USER + 45)
#define JS_CLASS_WIFI_MONITOR_SESSION (JS_CLASS_USER + 46)
#define JS_CLASS_WIFI_MONITOR_FRAME (JS_CLASS_USER + 47)
#define JS_CLASS_WIFI_MONITOR_BATCH (JS_CLASS_USER + 48)
#define JS_CLASS_WIFI_RAW_TX_SESSION (JS_CLASS_USER + 49)
#define JS_CLASS_WIFI_RAW_PERIODIC_TX (JS_CLASS_USER + 50)
#define JS_CLASS_WIFI_ROC_SESSION (JS_CLASS_USER + 51)
#define JS_CLASS_WIFI_FTM_SESSION (JS_CLASS_USER + 52)
#define JS_CLASS_WIFI_NEIGHBOR_REQUEST (JS_CLASS_USER + 53)
#define JS_CLASS_WIFI_TWT_AGREEMENT (JS_CLASS_USER + 54)
#define JS_CLASS_WIFI_SMARTCONFIG_SESSION (JS_CLASS_USER + 55)
#define JS_CLASS_WIFI_WPS_SESSION (JS_CLASS_USER + 56)
#define JS_CLASS_WIFI_WPS_AP_SESSION (JS_CLASS_USER + 57)
#define JS_CLASS_WIFI_DPP_SESSION (JS_CLASS_USER + 58)
#define JS_CLASS_WIFI_NAN_SESSION (JS_CLASS_USER + 59)
#define JS_CLASS_WIFI_NAN_SERVICE (JS_CLASS_USER + 60)
#define JS_CLASS_WIFI_NAN_PATH (JS_CLASS_USER + 61)
#define JS_CLASS_WIFI_NAN_PAIRING (JS_CLASS_USER + 62)
#define JS_CLASS_WIFI_MESH_SESSION (JS_CLASS_USER + 63)
#if ESP32_MQUICKJS_WIFI_MESH_AVAILABLE
#define JS_CLASS_COUNT (JS_CLASS_USER + 64)
#elif CONFIG_ESP32_MQUICKJS_FEATURE_WIFI && CONFIG_ESP_WIFI_NAN_PAIRING
#define JS_CLASS_COUNT (JS_CLASS_USER + 63)
#elif CONFIG_ESP32_MQUICKJS_FEATURE_WIFI && CONFIG_ESP_WIFI_NAN_SYNC_ENABLE
#define JS_CLASS_COUNT (JS_CLASS_USER + 62)
#elif CONFIG_ESP32_MQUICKJS_FEATURE_WIFI && CONFIG_ESP_WIFI_NAN_USD_ENABLE
#define JS_CLASS_COUNT (JS_CLASS_USER + 61)
#elif CONFIG_ESP32_MQUICKJS_FEATURE_WIFI && CONFIG_ESP_WIFI_DPP_SUPPORT && CONFIG_ESP_NETIF_USES_TCPIP_WITH_BSD_API && CONFIG_LWIP_IPV4
#define JS_CLASS_COUNT (JS_CLASS_USER + 59)
#elif CONFIG_ESP32_MQUICKJS_FEATURE_WIFI && CONFIG_ESP_NETIF_USES_TCPIP_WITH_BSD_API && CONFIG_LWIP_IPV4 && CONFIG_ESP_WIFI_WPS_SOFTAP_REGISTRAR
#define JS_CLASS_COUNT (JS_CLASS_USER + 58)
#elif CONFIG_ESP32_MQUICKJS_FEATURE_WIFI && CONFIG_ESP_NETIF_USES_TCPIP_WITH_BSD_API && CONFIG_LWIP_IPV4
#define JS_CLASS_COUNT (JS_CLASS_USER + 57)
#elif CONFIG_ESP32_MQUICKJS_FEATURE_WIFI && CONFIG_SOC_WIFI_HE_SUPPORT && CONFIG_IDF_TARGET_ESP32C5
#define JS_CLASS_COUNT (JS_CLASS_USER + 55)
#elif CONFIG_ESP32_MQUICKJS_FEATURE_WIFI && CONFIG_ESP_WIFI_RRM_SUPPORT
#define JS_CLASS_COUNT (JS_CLASS_USER + 54)
#elif CONFIG_ESP32_MQUICKJS_FEATURE_WIFI && CONFIG_ESP_WIFI_FTM_ENABLE && CONFIG_ESP_WIFI_FTM_INITIATOR_SUPPORT
#define JS_CLASS_COUNT (JS_CLASS_USER + 53)
#else
#define JS_CLASS_COUNT (JS_CLASS_USER + 52)
#endif

#define js_global_object js_global_object_base
#define js_c_function_decl js_c_function_decl_base
#define main mqjs_stdlib_base_main
#include "mqjs_stdlib.c"
#undef main
#undef js_c_function_decl
#undef js_global_object

static const JSPropDef js_headers_proto[] = {
    JS_CFUNC_DEF("get", 1, js_headers_get),
    JS_CFUNC_DEF("set", 2, js_headers_set),
    JS_CFUNC_DEF("has", 1, js_headers_has),
    JS_CFUNC_DEF("delete", 1, js_headers_delete),
    JS_CFUNC_DEF("entries", 0, js_headers_entries),
    JS_CFUNC_DEF("toObject", 0, js_headers_toObject),
    JS_PROP_END,
};

static const JSClassDef js_headers_class =
    JS_CLASS_DEF("Headers", 1, js_headers_constructor, JS_CLASS_HEADERS, NULL, js_headers_proto, NULL, NULL);

static const JSPropDef js_request_proto[] = {
    JS_CFUNC_DEF("text", 0, js_request_text),
    JS_CFUNC_DEF("json", 0, js_request_json),
    JS_CFUNC_DEF("bytes", 1, js_request_bytes),
    JS_PROP_END,
};

static const JSClassDef js_request_class =
    JS_CLASS_DEF("Request", 2, js_request_constructor, JS_CLASS_REQUEST, NULL, js_request_proto, NULL, NULL);

static const JSPropDef js_response[] = {
    JS_CFUNC_DEF("text", 2, js_response_make_text),
    JS_CFUNC_DEF("json", 2, js_response_make_json),
    JS_CFUNC_DEF("stream", 2, js_response_make_stream),
    JS_CFUNC_DEF("bytes", 2, js_response_make_bytes),
    JS_PROP_END,
};

static const JSPropDef js_response_proto[] = {
    JS_CFUNC_DEF("text", 0, js_response_text),
    JS_CFUNC_DEF("json", 0, js_response_json),
    JS_CFUNC_DEF("bytes", 1, js_response_bytes),
    JS_PROP_END,
};

static const JSClassDef js_response_class =
    JS_CLASS_DEF("Response", 2, js_response_constructor, JS_CLASS_RESPONSE, js_response, js_response_proto, NULL, NULL);

