99percentpeople/esp32qjs/components/esp32_mquickjs/src/core/mqjs_stdlib_esp32.c
static const JSPropDef js_future[] = {
    JS_CFUNC_DEF("call", 3, js_future_call),
    JS_CFUNC_DEF("all", 1, js_future_all),
    JS_CFUNC_DEF("race", 1, js_future_race),
    JS_CFUNC_DEF("sleep", 1, js_future_sleep),
    JS_CFUNC_DEF("timeout", 2, js_future_timeout),
    JS_PROP_END,
};

static const JSPropDef js_future_proto[] = {
    JS_CFUNC_DEF("status", 0, js_future_status),
    JS_CFUNC_DEF("wait", 1, js_future_wait),
    JS_CFUNC_DEF("cancel", 0, js_future_cancel),
    JS_CFUNC_DEF("map", 1, js_future_map),
    JS_CFUNC_DEF("flatMap", 1, js_future_flat_map),
    JS_PROP_END,
};

static const JSClassDef js_future_class =
    JS_CLASS_TRACE_DEF("Future", 0, js_future_constructor, JS_CLASS_FUTURE, js_future, js_future_proto, NULL, js_future_finalizer, js_future_gc_trace);

static const JSPropDef js_event_queue_proto[] = {
    JS_CFUNC_DEF("receive", 1, js_event_queue_receive),
    JS_CFUNC_DEF("stats", 0, js_event_queue_stats),
    JS_CFUNC_DEF("close", 0, js_event_queue_close),
    JS_PROP_END,
};

static const JSClassDef js_event_queue_class =
    JS_CLASS_DEF("EventQueue", 0, js_event_queue_constructor, JS_CLASS_EVENT_QUEUE, NULL, js_event_queue_proto, NULL, js_event_queue_finalizer);

static const JSPropDef js_stream[] = {
    JS_PROP_DOUBLE_DEF("SEEK_SET", 0, 0),
    JS_PROP_DOUBLE_DEF("SEEK_CUR", 1, 0),
    JS_PROP_DOUBLE_DEF("SEEK_END", 2, 0),
    JS_PROP_END,
};

static const JSPropDef js_stream_proto[] = {
    JS_CFUNC_DEF("read", 1, js_stream_read),
    JS_CFUNC_DEF("write", 1, js_stream_write),
    JS_CFUNC_DEF("flush", 0, js_stream_flush),
    JS_CFUNC_DEF("close", 0, js_stream_close),
    JS_CFUNC_DEF("seek", 2, js_stream_seek),
    JS_CFUNC_DEF("tell", 0, js_stream_tell),
    JS_CFUNC_DEF("eof", 0, js_stream_eof),
    JS_PROP_END,
};

static const JSClassDef js_stream_class =
    JS_CLASS_DEF("Stream", 0, js_stream_constructor, JS_CLASS_STREAM, js_stream,
                 js_stream_proto, NULL, js_stream_finalizer);

static const JSPropDef js_byte_view_proto[] = {
    JS_CGETSET_DEF("length", js_byte_view_get_length, NULL),
    JS_CGETSET_DEF("byteLength", js_byte_view_get_length, NULL),
    JS_CFUNC_DEF("getUint8", 1, js_byte_view_get_uint8),
    JS_CFUNC_DEF("toArray", 0, js_byte_view_to_array),
    JS_CFUNC_DEF("close", 0, js_byte_view_close),
    JS_PROP_END,
};

static const JSClassDef js_byte_view_class =
    JS_CLASS_DEF("ByteView", 0, js_byte_view_constructor, JS_CLASS_BYTE_VIEW, NULL, js_byte_view_proto, NULL, js_byte_view_finalizer);

static const JSPropDef js_byte_span_source_proto[] = {
    JS_CGETSET_DEF("byteLength", js_byte_span_source_get_length, NULL),
    JS_CFUNC_DEF("close", 0, js_byte_span_source_close),
    JS_PROP_END,
};

static const JSClassDef js_byte_span_source_class =
    JS_CLASS_DEF("ByteSpanSource", 0, js_byte_span_source_constructor, JS_CLASS_BYTE_SPAN_SOURCE, NULL, js_byte_span_source_proto, NULL, js_byte_span_source_finalizer);

#if CONFIG_ESP32_MQUICKJS_FEATURE_BITMAP
static const JSPropDef js_bitmap_span_source_proto[] = {
    JS_CFUNC_DEF("setRect", 4, js_bitmap_span_source_set_rect),
    JS_PROP_END,
};

static const JSClassDef js_bitmap_span_source_class =
    JS_CLASS_DEF("BitmapSpanSource",
                 0,
                 js_bitmap_span_source_constructor,
                 JS_CLASS_BITMAP_SPAN_SOURCE,
                 NULL,
                 js_bitmap_span_source_proto,
                 &js_byte_span_source_class,
                 js_byte_span_source_finalizer);

static const JSPropDef js_display_font_proto[] = {
    JS_CGETSET_DEF("name", js_display_font_get_name, NULL),
    JS_CGETSET_DEF("width", js_display_font_get_width, NULL),
    JS_CGETSET_DEF("height", js_display_font_get_height, NULL),
    JS_CGETSET_DEF("advance", js_display_font_get_advance, NULL),
    JS_CGETSET_DEF("lineHeight", js_display_font_get_line_height, NULL),
    JS_PROP_END,
};

static const JSClassDef js_display_font_class =
    JS_CLASS_DEF("DisplayFont", 0, js_display_font_constructor, JS_CLASS_DISPLAY_FONT, NULL, js_display_font_proto, NULL, js_display_font_finalizer);

static const JSPropDef js_display_command_buffer_proto[] = {
    JS_CFUNC_DEF("reset", 0, js_display_command_buffer_reset),
    JS_CFUNC_DEF("close", 0, js_display_command_buffer_close),
    JS_CFUNC_DEF("clear", 1, js_display_command_buffer_clear),
    JS_CFUNC_DEF("fill", 1, js_display_command_buffer_clear),
    JS_CFUNC_DEF("fillRect", 5, js_display_command_buffer_fill_rect),
    JS_CFUNC_DEF("drawRect", 5, js_display_command_buffer_draw_rect),
    JS_CFUNC_DEF("drawLine", 5, js_display_command_buffer_draw_line),
    JS_CFUNC_DEF("drawRoundRect", 6, js_display_command_buffer_draw_round_rect),
    JS_CFUNC_DEF("fillRoundRect", 6, js_display_command_buffer_fill_round_rect),
    JS_CFUNC_DEF("drawText", 4, js_display_command_buffer_draw_text),
    JS_CFUNC_DEF("appendPacked", 2, js_display_command_buffer_append_packed),
    JS_CFUNC_DEF("replay", 1, js_display_command_buffer_replay),
    JS_CFUNC_DEF("stats", 0, js_display_command_buffer_stats),
    JS_PROP_END,
};

static const JSClassDef js_display_command_buffer_class =
    JS_CLASS_DEF("DisplayCommandBuffer",
                 0,
                 js_display_command_buffer_constructor,
                 JS_CLASS_DISPLAY_COMMAND_BUFFER,
                 NULL,
                 js_display_command_buffer_proto,
                 NULL,
                 js_display_command_buffer_finalizer);

static const JSPropDef js_bitmap_proto[] = {
    JS_CGETSET_DEF("width", js_bitmap_get_width, NULL),
    JS_CGETSET_DEF("height", js_bitmap_get_height, NULL),
    JS_CGETSET_DEF("format", js_bitmap_get_format, NULL),
    JS_CGETSET_DEF("layout", js_bitmap_get_layout, NULL),
    JS_CGETSET_DEF("stride", js_bitmap_get_stride, NULL),
    JS_CGETSET_DEF("pageHeight", js_bitmap_get_page_height, NULL),
    JS_CGETSET_DEF("byteLength", js_bitmap_get_byte_length, NULL),
    JS_CFUNC_DEF("close", 0, js_bitmap_close),
    JS_CFUNC_DEF("clear", 1, js_bitmap_clear),
    JS_CFUNC_DEF("fill", 1, js_bitmap_clear),
    JS_CFUNC_DEF("setPixel", 3, js_bitmap_set_pixel),
    JS_CFUNC_DEF("getPixel", 2, js_bitmap_get_pixel),
    JS_CFUNC_DEF("fillRect", 5, js_bitmap_fill_rect),
    JS_CFUNC_DEF("drawCircle", 4, js_bitmap_draw_circle),
    JS_CFUNC_DEF("fillCircle", 4, js_bitmap_fill_circle),
    JS_CFUNC_DEF("drawEllipse", 5, js_bitmap_draw_ellipse),
    JS_CFUNC_DEF("fillEllipse", 5, js_bitmap_fill_ellipse),
    JS_CFUNC_DEF("drawRect", 5, js_bitmap_draw_rect),
    JS_CFUNC_DEF("drawRoundRect", 6, js_bitmap_draw_round_rect),
    JS_CFUNC_DEF("fillRoundRect", 6, js_bitmap_fill_round_rect),
    JS_CFUNC_DEF("drawLine", 5, js_bitmap_draw_line),
    JS_CFUNC_DEF("drawPolyline", 2, js_bitmap_draw_polyline),
    JS_CFUNC_DEF("drawPolygon", 2, js_bitmap_draw_polygon),
    JS_CFUNC_DEF("fillPolygon", 2, js_bitmap_fill_polygon),
    JS_CFUNC_DEF("drawTriangle", 7, js_bitmap_draw_triangle),
    JS_CFUNC_DEF("fillTriangle", 7, js_bitmap_fill_triangle),
    JS_CFUNC_DEF("drawQuadraticBezier", 8, js_bitmap_draw_quadratic_bezier),
    JS_CFUNC_DEF("drawCubicBezier", 10, js_bitmap_draw_cubic_bezier),
    JS_CFUNC_DEF("drawMask", 4, js_bitmap_draw_mask),
    JS_CFUNC_DEF("blit", 2, js_bitmap_blit),
    JS_CFUNC_DEF("blitBatch", 1, js_bitmap_blit_batch),
#if CONFIG_ESP32_MQUICKJS_FEATURE_BITMAP_JPEG
    JS_CFUNC_DEF("decode", 2, js_bitmap_decode),
#endif
    JS_CFUNC_DEF("drawText", 5, js_bitmap_draw_text),
    JS_CFUNC_DEF("measureText", 2, js_bitmap_measure_text),
    JS_CFUNC_DEF("getDirty", 0, js_bitmap_get_dirty),
    JS_CFUNC_DEF("clearDirty", 0, js_bitmap_clear_dirty),
    JS_CFUNC_DEF("markDirty", 4, js_bitmap_mark_dirty),
    JS_CFUNC_DEF("readRect", 5, js_bitmap_read_rect),
    JS_CFUNC_DEF("readRectChunks", 5, js_bitmap_read_rect_chunks),
    JS_CFUNC_DEF("createSpanSource", 1, js_bitmap_create_span_source),
    JS_CFUNC_DEF("createCommandBuffer", 1, js_bitmap_create_command_buffer),
    JS_PROP_END,
};

static const JSClassDef js_bitmap_class =
    JS_CLASS_DEF("Bitmap", 0, js_bitmap_constructor, JS_CLASS_BITMAP, NULL, js_bitmap_proto, NULL, js_bitmap_finalizer);

static const JSPropDef js_bitmap[] = {
    JS_PROP_STRING_DEF("MONO1", "mono1", 0),
    JS_PROP_STRING_DEF("GRAY4", "gray4", 0),
    JS_PROP_STRING_DEF("GRAY8", "gray8", 0),
    JS_PROP_STRING_DEF("RGB565", "rgb565", 0),
    JS_PROP_STRING_DEF("RGB888", "rgb888", 0),
    JS_CFUNC_DEF("create", 1, js_bitmap_create),
    JS_CFUNC_DEF("convert", 2, js_bitmap_convert),
    JS_CFUNC_DEF("loadFont", 1, js_bitmap_load_font),
    JS_PROP_END,
};

static const JSClassDef js_bitmap_obj =
    JS_OBJECT_DEF("bitmap", js_bitmap);
#endif

#if CONFIG_ESP32_MQUICKJS_FEATURE_FS
static const JSPropDef js_fs[] = {
    JS_CGETSET_DEF("ROOT", js_fs_get_root, NULL),
    JS_CFUNC_DEF("mounts", 0, js_fs_mounts),
    JS_CFUNC_DEF("info", 1, js_fs_info),
    JS_CFUNC_DEF("watch", 2, js_fs_watch),
    JS_CFUNC_DEF("open", 2, js_fs_open),
    JS_CFUNC_DEF("list", 1, js_fs_list),
    JS_CFUNC_DEF("stat", 1, js_fs_stat),
    JS_CFUNC_DEF("exists", 1, js_fs_exists),
    JS_CFUNC_DEF("readText", 1, js_fs_readText),
    JS_CFUNC_DEF("writeText", 2, js_fs_writeText),
    JS_CFUNC_DEF("appendText", 2, js_fs_appendText),
    JS_CFUNC_DEF("remove", 1, js_fs_remove),
    JS_CFUNC_DEF("rename", 2, js_fs_rename),
    JS_CFUNC_DEF("mkdir", 1, js_fs_mkdir),
    JS_PROP_END,
};

static const JSClassDef js_fs_obj = JS_OBJECT_DEF("fs", js_fs);

static const JSPropDef js_framework[] = {
    JS_CFUNC_DEF("load", 1, js_framework_load),
    JS_PROP_END,
};

static const JSClassDef js_framework_obj =
    JS_OBJECT_DEF("framework", js_framework);

#endif

