99percentpeople/esp32qjs/components/esp32_mquickjs/src/core/mqjs_stdlib_esp32.c
#if CONFIG_ESP32_MQUICKJS_FEATURE_NVS
static const JSPropDef js_nvs[] = {
    JS_CGETSET_DEF("MAX_VALUE_BYTES", js_nvs_get_max_value_bytes, NULL),
    JS_CFUNC_DEF("getString", 2, js_nvs_getString),
    JS_CFUNC_DEF("setString", 3, js_nvs_setString),
    JS_CFUNC_DEF("erase", 2, js_nvs_erase),
    JS_CFUNC_DEF("clear", 1, js_nvs_clear),
    JS_CFUNC_DEF("status", 0, js_nvs_status),
    JS_PROP_END,
};

static const JSClassDef js_nvs_obj =
    JS_OBJECT_DEF("nvs", js_nvs);
#endif

#if CONFIG_ESP32_MQUICKJS_FEATURE_GPIO
static const JSPropDef js_gpio[] = {
    JS_PROP_STRING_DEF("DISABLED", "disabled", 0),
    JS_PROP_STRING_DEF("INPUT", "input", 0),
    JS_PROP_STRING_DEF("OUTPUT", "output", 0),
    JS_PROP_STRING_DEF("INPUT_OUTPUT", "inputOutput", 0),
    JS_PROP_STRING_DEF("OUTPUT_OPEN_DRAIN", "outputOpenDrain", 0),
    JS_PROP_STRING_DEF("INPUT_OUTPUT_OPEN_DRAIN", "inputOutputOpenDrain", 0),
    JS_PROP_STRING_DEF("FLOATING", "floating", 0),
    JS_PROP_STRING_DEF("PULLUP", "pullup", 0),
    JS_PROP_STRING_DEF("PULLDOWN", "pulldown", 0),
    JS_PROP_STRING_DEF("PULLUP_PULLDOWN", "pullupPulldown", 0),
    JS_PROP_STRING_DEF("CHANGE", "change", 0),
    JS_PROP_STRING_DEF("RISING", "rising", 0),
    JS_PROP_STRING_DEF("FALLING", "falling", 0),
    JS_PROP_DOUBLE_DEF("LOW", 0, 0),
    JS_PROP_DOUBLE_DEF("HIGH", 1, 0),
    JS_PROP_DOUBLE_DEF("DRIVE_0", 0, 0),
    JS_PROP_DOUBLE_DEF("DRIVE_1", 1, 0),
    JS_PROP_DOUBLE_DEF("DRIVE_2", 2, 0),
    JS_PROP_DOUBLE_DEF("DRIVE_3", 3, 0),
    JS_CGETSET_DEF("LED_BUILTIN", js_gpio_get_led_builtin, NULL),
    JS_CGETSET_DEF("USER_LED_PIN", js_gpio_get_user_led_pin, NULL),
    JS_CGETSET_DEF("USER_LED_ACTIVE_LOW", js_gpio_get_user_led_active_low, NULL),
    JS_CFUNC_DEF("isValid", 1, js_gpio_isValid),
    JS_CFUNC_DEF("isOutputCapable", 1, js_gpio_isOutputCapable),
    JS_CFUNC_DEF("pinMode", 2, js_gpio_pinMode),
    JS_CFUNC_DEF("setPull", 2, js_gpio_setPull),
    JS_CFUNC_DEF("status", 1, js_gpio_status),
    JS_CFUNC_DEF("configure", 2, js_gpio_configure),
    JS_CFUNC_DEF("digitalWrite", 2, js_gpio_digitalWrite),
    JS_CFUNC_DEF("digitalRead", 1, js_gpio_digitalRead),
    JS_CFUNC_DEF("toggle", 1, js_gpio_toggle),
    JS_CFUNC_DEF("getDriveStrength", 1, js_gpio_getDriveStrength),
    JS_CFUNC_DEF("setDriveStrength", 2, js_gpio_setDriveStrength),
    JS_CFUNC_DEF("hold", 2, js_gpio_hold),
    JS_CFUNC_DEF("watch", 2, js_gpio_watch),
    JS_CFUNC_DEF("reset", 1, js_gpio_reset),
    JS_CFUNC_DEF("led", 1, js_gpio_led),
    JS_PROP_END,
};

static const JSClassDef js_gpio_obj =
    JS_OBJECT_DEF("gpio", js_gpio);
#endif

#if CONFIG_ESP32_MQUICKJS_FEATURE_LEDC
static const JSPropDef js_ledc[] = {
    JS_PROP_STRING_DEF("AUTO_CLOCK", "auto", 0),
    JS_PROP_STRING_DEF("APB_CLOCK", "apb", 0),
    JS_PROP_STRING_DEF("XTAL_CLOCK", "xtal", 0),
    JS_PROP_STRING_DEF("RC_FAST_CLOCK", "rcFast", 0),
    JS_PROP_STRING_DEF("SLEEP_NO_ALIVE_NO_PD", "noAliveNoPd", 0),
    JS_PROP_STRING_DEF("SLEEP_NO_ALIVE_ALLOW_PD", "noAliveAllowPd", 0),
    JS_PROP_STRING_DEF("SLEEP_KEEP_ALIVE", "keepAlive", 0),
    JS_CGETSET_DEF("CHANNEL_COUNT", js_ledc_get_channel_count, NULL),
    JS_CGETSET_DEF("TIMER_COUNT", js_ledc_get_timer_count, NULL),
    JS_CGETSET_DEF("MAX_DUTY_RESOLUTION_BITS", js_ledc_get_max_duty_resolution_bits, NULL),
    JS_CFUNC_DEF("timerConfig", 2, js_ledc_timerConfig),
    JS_CFUNC_DEF("channelConfig", 2, js_ledc_channelConfig),
    JS_CFUNC_DEF("setDuty", 2, js_ledc_setDuty),
    JS_CFUNC_DEF("setDutyWithHpoint", 3, js_ledc_setDutyWithHpoint),
    JS_CFUNC_DEF("setDutyAndUpdate", 2, js_ledc_setDutyAndUpdate),
    JS_CFUNC_DEF("getDuty", 1, js_ledc_getDuty),
    JS_CFUNC_DEF("getHpoint", 1, js_ledc_getHpoint),
    JS_CFUNC_DEF("updateDuty", 1, js_ledc_updateDuty),
    JS_CFUNC_DEF("setFreq", 2, js_ledc_setFreq),
    JS_CFUNC_DEF("getFreq", 1, js_ledc_getFreq),
    JS_CFUNC_DEF("bindChannelTimer", 2, js_ledc_bindChannelTimer),
    JS_CFUNC_DEF("stop", 2, js_ledc_stop),
    JS_CFUNC_DEF("timerPause", 1, js_ledc_timerPause),
    JS_CFUNC_DEF("timerResume", 1, js_ledc_timerResume),
    JS_CFUNC_DEF("timerStatus", 1, js_ledc_timerStatus),
    JS_CFUNC_DEF("channelStatus", 1, js_ledc_channelStatus),
    JS_PROP_END,
};

static const JSClassDef js_ledc_obj =
    JS_OBJECT_DEF("ledc", js_ledc);
#endif

#if CONFIG_ESP32_MQUICKJS_FEATURE_ADC
static const JSPropDef js_adc[] = {
    JS_PROP_DOUBLE_DEF("UNIT_1", 1, 0),
    JS_PROP_DOUBLE_DEF("UNIT_2", 2, 0),
    JS_PROP_DOUBLE_DEF("ATTEN_DB_0", 0, 0),
    JS_PROP_DOUBLE_DEF("ATTEN_DB_2_5", 1, 0),
    JS_PROP_DOUBLE_DEF("ATTEN_DB_6", 2, 0),
    JS_PROP_DOUBLE_DEF("ATTEN_DB_12", 3, 0),
    JS_PROP_DOUBLE_DEF("BITWIDTH_DEFAULT", 0, 0),
    JS_PROP_DOUBLE_DEF("BITWIDTH_9", 9, 0),
    JS_PROP_DOUBLE_DEF("BITWIDTH_10", 10, 0),
    JS_PROP_DOUBLE_DEF("BITWIDTH_11", 11, 0),
    JS_PROP_DOUBLE_DEF("BITWIDTH_12", 12, 0),
    JS_PROP_DOUBLE_DEF("BITWIDTH_13", 13, 0),
    JS_CGETSET_DEF("UNIT_COUNT", js_adc_get_unit_count, NULL),
    JS_CGETSET_DEF("MAX_CHANNEL_COUNT", js_adc_get_max_channel_count, NULL),
    JS_CFUNC_DEF("open", 1, js_adc_open),
    JS_CFUNC_DEF("close", 1, js_adc_close),
    JS_CFUNC_DEF("status", 1, js_adc_status),
    JS_CFUNC_DEF("configure", 3, js_adc_configure),
    JS_CFUNC_DEF("read", 2, js_adc_read),
    JS_CFUNC_DEF("readMilliVolts", 2, js_adc_readMilliVolts),
    JS_CFUNC_DEF("ioToChannel", 1, js_adc_ioToChannel),
    JS_CFUNC_DEF("channelToIo", 2, js_adc_channelToIo),
    JS_PROP_END,
};

static const JSClassDef js_adc_obj =
    JS_OBJECT_DEF("adc", js_adc);
#endif

#if CONFIG_ESP32_MQUICKJS_FEATURE_DAC
static const JSPropDef js_dac[] = {
    JS_PROP_DOUBLE_DEF("CHANNEL_0", 0, 0),
    JS_PROP_DOUBLE_DEF("CHANNEL_1", 1, 0),
    JS_CGETSET_DEF("CHANNEL_COUNT", js_dac_get_channel_count, NULL),
    JS_CGETSET_DEF("RESOLUTION_BITS", js_dac_get_resolution_bits, NULL),
    JS_CGETSET_DEF("MAX_VALUE", js_dac_get_max_value, NULL),
    JS_CFUNC_DEF("open", 1, js_dac_open),
    JS_CFUNC_DEF("close", 1, js_dac_close),
    JS_CFUNC_DEF("status", 1, js_dac_status),
    JS_CFUNC_DEF("write", 2, js_dac_write),
    JS_CFUNC_DEF("ioToChannel", 1, js_dac_ioToChannel),
    JS_CFUNC_DEF("channelToIo", 1, js_dac_channelToIo),
    JS_PROP_END,
};

static const JSClassDef js_dac_obj =
    JS_OBJECT_DEF("dac", js_dac);
#endif

static const JSPropDef js_sys_info_version[] = {
    JS_CGETSET_MAGIC_DEF("framework", js_sys_version_get, NULL, 0),
    JS_CGETSET_MAGIC_DEF("hostApi", js_sys_version_get, NULL, 1),
    JS_CGETSET_MAGIC_DEF("mquickjs", js_sys_version_get, NULL, 2),
    JS_CGETSET_MAGIC_DEF("espIdf", js_sys_version_get, NULL, 3),
    JS_PROP_END,
};

static const JSClassDef js_sys_info_version_obj =
    JS_OBJECT_DEF("version", js_sys_info_version);

static const JSPropDef js_sys_info_features[] = {
    JS_CGETSET_MAGIC_DEF("fs", js_sys_feature_get, NULL, 0),
    JS_CGETSET_MAGIC_DEF("nvs", js_sys_feature_get, NULL, 1),
    JS_CGETSET_MAGIC_DEF("gpio", js_sys_feature_get, NULL, 2),
    JS_CGETSET_MAGIC_DEF("ledc", js_sys_feature_get, NULL, 3),
    JS_CGETSET_MAGIC_DEF("adc", js_sys_feature_get, NULL, 4),
    JS_CGETSET_MAGIC_DEF("dac", js_sys_feature_get, NULL, 5),
    JS_CGETSET_MAGIC_DEF("i2c", js_sys_feature_get, NULL, 6),
    JS_CGETSET_MAGIC_DEF("spi", js_sys_feature_get, NULL, 7),
    JS_CGETSET_MAGIC_DEF("uart", js_sys_feature_get, NULL, 8),
    JS_CGETSET_MAGIC_DEF("usbSerial", js_sys_feature_get, NULL, 9),
    JS_CGETSET_MAGIC_DEF("socket", js_sys_feature_get, NULL, 10),
    JS_CGETSET_MAGIC_DEF("websocket", js_sys_feature_get, NULL, 11),
    JS_CGETSET_MAGIC_DEF("bitmap", js_sys_feature_get, NULL, 12),
    JS_CGETSET_MAGIC_DEF("wifi", js_sys_feature_get, NULL, 13),
    JS_CGETSET_MAGIC_DEF("http", js_sys_feature_get, NULL, 14),
    JS_CGETSET_MAGIC_DEF("httpServer", js_sys_feature_get, NULL, 15),
    JS_CGETSET_MAGIC_DEF("runtimeLogs", js_sys_feature_get, NULL, 16),
    JS_CGETSET_MAGIC_DEF("i2s", js_sys_feature_get, NULL, 17),
    JS_CGETSET_MAGIC_DEF("camera", js_sys_feature_get, NULL, 18),
    JS_CGETSET_MAGIC_DEF("rpc", js_sys_feature_get, NULL, 19),
    JS_CGETSET_MAGIC_DEF("rmt", js_sys_feature_get, NULL, 20),
    JS_CGETSET_MAGIC_DEF("tls", js_sys_feature_get, NULL, 21),
    JS_CGETSET_MAGIC_DEF("net", js_sys_feature_get, NULL, 22),
    JS_CGETSET_MAGIC_DEF("espNow", js_sys_feature_get, NULL, 23),
    JS_CGETSET_MAGIC_DEF("ble", js_sys_feature_get, NULL, 24),
    JS_CGETSET_MAGIC_DEF("wifiCsi", js_sys_feature_get, NULL, 25),
    JS_CGETSET_MAGIC_DEF("bitmapJpeg", js_sys_feature_get, NULL, 26),
    JS_PROP_END,
};

