99percentpeople/esp32qjs/components/esp32_mquickjs/src/core/mqjs_stdlib_esp32.c
static const JSPropDef js_i2c_device_proto[] = {
    JS_CFUNC_DEF("close", 0, js_i2c_device_close),
    JS_CFUNC_DEF("status", 0, js_i2c_device_status),
    JS_CFUNC_DEF("write", 1, js_i2c_device_write),
    JS_CFUNC_DEF("writeSegments", 1, js_i2c_device_write_segments),
    JS_CFUNC_DEF("writeBatch", 1, js_i2c_device_write_batch),
    JS_CFUNC_DEF("read", 1, js_i2c_device_read),
    JS_CFUNC_DEF("writeRead", 2, js_i2c_device_write_read),
    JS_PROP_END,
};

static const JSClassDef js_i2c_device_class =
    JS_CLASS_DEF("I2CDevice", 0, js_i2c_device_constructor, JS_CLASS_I2C_DEVICE, NULL, js_i2c_device_proto, NULL, js_i2c_device_finalizer);

static const JSPropDef js_i2c[] = {
    JS_CGETSET_DEF("DEFAULT_SDA", js_i2c_get_default_sda, NULL),
    JS_CGETSET_DEF("DEFAULT_SCL", js_i2c_get_default_scl, NULL),
    JS_CGETSET_DEF("DEFAULT_FREQ_HZ", js_i2c_get_default_freq_hz, NULL),
    JS_CGETSET_DEF("DEFAULT_TIMEOUT_MS", js_i2c_get_default_timeout_ms, NULL),
    JS_CFUNC_DEF("openBus", 1, js_i2c_open_bus),
    JS_PROP_END,
};

static const JSClassDef js_i2c_obj =
    JS_OBJECT_DEF("i2c", js_i2c);
#endif

#if CONFIG_ESP32_MQUICKJS_FEATURE_SPI
static const JSPropDef js_spi_bus_proto[] = {
    JS_CFUNC_DEF("close", 0, js_spi_bus_close),
    JS_CFUNC_DEF("status", 0, js_spi_bus_status),
    JS_CFUNC_DEF("openDevice", 1, js_spi_bus_open_device),
    JS_PROP_END,
};

static const JSClassDef js_spi_bus_class =
    JS_CLASS_DEF("SPIBus", 0, js_spi_bus_constructor, JS_CLASS_SPI_BUS, NULL, js_spi_bus_proto, NULL, js_spi_bus_finalizer);

static const JSPropDef js_spi_device_proto[] = {
    JS_CFUNC_DEF("close", 0, js_spi_device_close),
    JS_CFUNC_DEF("status", 0, js_spi_device_status),
    JS_CFUNC_DEF("transfer", 1, js_spi_device_transfer),
    JS_CFUNC_DEF("write", 1, js_spi_device_write),
    JS_CFUNC_DEF("writeChunks", 2, js_spi_device_write_chunks),
    JS_CFUNC_DEF("writeSource", 2, js_spi_device_write_source),
    JS_CFUNC_DEF("read", 2, js_spi_device_read),
    JS_PROP_END,
};

static const JSClassDef js_spi_device_class =
    JS_CLASS_DEF("SPIDevice", 0, js_spi_device_constructor, JS_CLASS_SPI_DEVICE, NULL, js_spi_device_proto, NULL, js_spi_device_finalizer);

static const JSPropDef js_spi[] = {
    JS_CGETSET_DEF("HOST_2", js_spi_get_host_2, NULL),
#if CONFIG_SOC_SPI_PERIPH_NUM > 2
    JS_CGETSET_DEF("HOST_3", js_spi_get_host_3, NULL),
#endif
    JS_CGETSET_DEF("DEFAULT_HOST", js_spi_get_default_host, NULL),
    JS_CGETSET_DEF("DEFAULT_SCLK", js_spi_get_default_sclk, NULL),
    JS_CGETSET_DEF("DEFAULT_MOSI", js_spi_get_default_mosi, NULL),
    JS_CGETSET_DEF("DEFAULT_MISO", js_spi_get_default_miso, NULL),
    JS_CGETSET_DEF("DEFAULT_CS", js_spi_get_default_cs, NULL),
    JS_CGETSET_DEF("DEFAULT_FREQ_HZ", js_spi_get_default_freq_hz, NULL),
    JS_CGETSET_DEF("DEFAULT_QUEUE_SIZE", js_spi_get_default_queue_size, NULL),
    JS_CGETSET_DEF("DEFAULT_MAX_TRANSFER_SIZE", js_spi_get_default_max_transfer_size, NULL),
    JS_CFUNC_DEF("openBus", 1, js_spi_open_bus),
    JS_PROP_END,
};

static const JSClassDef js_spi_obj =
    JS_OBJECT_DEF("spi", js_spi);
#endif

#if CONFIG_ESP32_MQUICKJS_FEATURE_UART
static const JSPropDef js_uart_port_proto[] = {
    JS_CFUNC_DEF("close", 0, js_uart_port_close),
    JS_CFUNC_DEF("status", 0, js_uart_port_status),
    JS_CFUNC_DEF("write", 1, js_uart_port_write),
    JS_CFUNC_DEF("writeChunks", 1, js_uart_port_write_chunks),
    JS_CFUNC_DEF("writeSource", 1, js_uart_port_write_source),
    JS_CFUNC_DEF("read", 2, js_uart_port_read),
    JS_CFUNC_DEF("available", 0, js_uart_port_available),
    JS_CFUNC_DEF("flush", 1, js_uart_port_flush),
    JS_CFUNC_DEF("clearRx", 0, js_uart_port_clear_rx),
    JS_CFUNC_DEF("watch", 1, js_uart_port_watch),
    JS_PROP_END,
};

static const JSClassDef js_uart_port_class =
    JS_CLASS_DEF("UARTPort", 0, js_uart_port_constructor, JS_CLASS_UART_PORT, NULL, js_uart_port_proto, NULL, js_uart_port_finalizer);

static const JSPropDef js_uart[] = {
    JS_CGETSET_DEF("DEFAULT_PORT", js_uart_get_default_port, NULL),
    JS_CGETSET_DEF("DEFAULT_TX", js_uart_get_default_tx, NULL),
    JS_CGETSET_DEF("DEFAULT_RX", js_uart_get_default_rx, NULL),
    JS_CGETSET_DEF("DEFAULT_BAUD", js_uart_get_default_baud, NULL),
    JS_CGETSET_DEF("DEFAULT_RX_BUFFER_SIZE", js_uart_get_default_rx_buffer_size, NULL),
    JS_CGETSET_DEF("DEFAULT_TX_BUFFER_SIZE", js_uart_get_default_tx_buffer_size, NULL),
    JS_CGETSET_DEF("DEFAULT_TIMEOUT_MS", js_uart_get_default_timeout_ms, NULL),
    JS_CFUNC_DEF("open", 1, js_uart_open),
    JS_PROP_END,
};

static const JSClassDef js_uart_obj =
    JS_OBJECT_DEF("uart", js_uart);
#endif

#if CONFIG_ESP32_MQUICKJS_FEATURE_RMT
static const JSPropDef js_rmt_symbol_buffer_proto[] = {
    JS_CGETSET_DEF("capacity", js_rmt_symbol_buffer_get_capacity, NULL),
    JS_CGETSET_DEF("length", js_rmt_symbol_buffer_get_length, NULL),
    JS_CFUNC_DEF("push", 4, js_rmt_symbol_buffer_push),
    JS_CFUNC_DEF("get", 1, js_rmt_symbol_buffer_get),
    JS_CFUNC_DEF("set", 5, js_rmt_symbol_buffer_set),
    JS_CFUNC_DEF("clear", 0, js_rmt_symbol_buffer_clear),
    JS_CFUNC_DEF("close", 0, js_rmt_symbol_buffer_close),
    JS_PROP_END,
};

static const JSClassDef js_rmt_symbol_buffer_class =
    JS_CLASS_DEF("RMTSymbolBuffer", 0, js_rmt_symbol_buffer_constructor,
                 JS_CLASS_RMT_SYMBOL_BUFFER, NULL,
                 js_rmt_symbol_buffer_proto, NULL,
                 js_rmt_symbol_buffer_finalizer);

static const JSPropDef js_rmt_channel_proto[] = {
    JS_CFUNC_DEF("start", 0, js_rmt_channel_start),
    JS_CFUNC_DEF("stop", 0, js_rmt_channel_stop),
    JS_CFUNC_DEF("transmit", 2, js_rmt_channel_transmit),
    JS_CFUNC_DEF("receive", 2, js_rmt_channel_receive),
    JS_CFUNC_DEF("status", 0, js_rmt_channel_status),
    JS_CFUNC_DEF("close", 0, js_rmt_channel_close),
    JS_PROP_END,
};

static const JSClassDef js_rmt_channel_class =
    JS_CLASS_DEF("RMTChannel", 0, js_rmt_channel_constructor,
                 JS_CLASS_RMT_CHANNEL, NULL, js_rmt_channel_proto, NULL,
                 js_rmt_channel_finalizer);

static const JSPropDef js_rmt[] = {
    JS_CFUNC_DEF("capabilities", 0, js_rmt_capabilities),
    JS_CFUNC_DEF("createSymbols", 1, js_rmt_create_symbols),
    JS_CFUNC_DEF("open", 1, js_rmt_open),
    JS_PROP_END,
};

static const JSClassDef js_rmt_obj = JS_OBJECT_DEF("rmt", js_rmt);
#endif

#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI_CSI
static const JSPropDef js_wifi_csi_session_proto[] = {
    JS_CFUNC_DEF("status", 0, js_wifi_csi_session_status),
    JS_CFUNC_DEF("getCaptureConfig", 0, js_wifi_csi_session_get_capture_config),
    JS_CFUNC_DEF("stats", 0, js_wifi_csi_session_stats),
    JS_CFUNC_DEF("receive", 1, js_wifi_csi_session_receive),
    JS_CFUNC_DEF("receiveBatch", 2, js_wifi_csi_session_receive_batch),
    JS_CFUNC_DEF("stop", 0, js_wifi_csi_session_stop),
    JS_CFUNC_DEF("configure", 1, js_wifi_csi_session_configure),
    JS_CFUNC_DEF("start", 0, js_wifi_csi_session_start),
    JS_CFUNC_DEF("close", 0, js_wifi_csi_session_close),
    JS_PROP_END,
};

static const JSClassDef js_wifi_csi_session_class =
    JS_CLASS_DEF("WiFiCsiSession", 0, js_wifi_csi_session_constructor,
                 JS_CLASS_WIFI_CSI_SESSION, NULL,
                 js_wifi_csi_session_proto, NULL,
                 js_wifi_csi_session_finalizer);

static const JSPropDef js_wifi_csi_frame_proto[] = {
    JS_CFUNC_DEF("samples", 0, js_wifi_csi_frame_samples),
    JS_CFUNC_DEF("copySamples", 0, js_wifi_csi_frame_copy_samples),
    JS_CFUNC_DEF("sampleSource", 0, js_wifi_csi_frame_sample_source),
    JS_CFUNC_DEF("packetBytes", 0, js_wifi_csi_frame_packet_bytes),
    JS_CFUNC_DEF("copyPacketBytes", 0, js_wifi_csi_frame_copy_packet_bytes),
    JS_CFUNC_DEF("packetSource", 0, js_wifi_csi_frame_packet_source),
    JS_CFUNC_DEF("source", 1, js_wifi_csi_frame_source),
    JS_CFUNC_DEF("close", 0, js_wifi_csi_frame_close),
    JS_PROP_END,
};

static const JSClassDef js_wifi_csi_frame_class =
    JS_CLASS_DEF("WiFiCsiFrame", 0, js_wifi_csi_frame_constructor,
                 JS_CLASS_WIFI_CSI_FRAME, NULL, js_wifi_csi_frame_proto,
                 NULL, js_wifi_csi_frame_finalizer);

static const JSPropDef js_wifi_csi_batch_proto[] = {
    JS_CFUNC_DEF("info", 1, js_wifi_csi_batch_info),
    JS_CFUNC_DEF("samples", 1, js_wifi_csi_batch_samples),
    JS_CFUNC_DEF("packetBytes", 1, js_wifi_csi_batch_packet_bytes),
    JS_CFUNC_DEF("source", 1, js_wifi_csi_batch_source),
    JS_CFUNC_DEF("close", 0, js_wifi_csi_batch_close),
    JS_PROP_END,
};

