99percentpeople/esp32qjs/components/esp32_mquickjs/src/core/mqjs_stdlib_esp32.c
static const JSClassDef js_wifi_csi_batch_class =
    JS_CLASS_DEF("WiFiCsiBatch", 0, js_wifi_csi_batch_constructor,
                 JS_CLASS_WIFI_CSI_BATCH, NULL, js_wifi_csi_batch_proto,
                 NULL, js_wifi_csi_batch_finalizer);

static const JSPropDef js_wifi_csi[] = {
    JS_CFUNC_DEF("capabilities", 0, js_wifi_csi_capabilities),
    JS_CFUNC_DEF("open", 1, js_wifi_csi_open),
    JS_PROP_END,
};

static const JSClassDef js_wifi_csi_obj =
    JS_OBJECT_DEF("csi", js_wifi_csi);
#endif

#if CONFIG_ESP32_MQUICKJS_FEATURE_ESPNOW
static const JSPropDef js_espnow_session_proto[] = {
    JS_CFUNC_DEF("receive", 1, js_espnow_session_receive),
    JS_CFUNC_DEF("stats", 0, js_espnow_session_stats),
    JS_CFUNC_DEF("status", 0, js_espnow_session_status),
    JS_CFUNC_DEF("addPeer", 1, js_espnow_session_add_peer),
    JS_CFUNC_DEF("peer", 1, js_espnow_session_peer),
    JS_CFUNC_DEF("peers", 0, js_espnow_session_peers),
    JS_CFUNC_DEF("broadcast", 2, js_espnow_session_broadcast),
    JS_CFUNC_DEF("enqueueBroadcast", 1,
                 js_espnow_session_enqueue_broadcast),
    JS_CFUNC_DEF("enqueueBroadcastBatch", 1,
                 js_espnow_session_enqueue_broadcast_batch),
    JS_CFUNC_DEF("flushTx", 1, js_espnow_session_flush_tx),
    JS_CFUNC_DEF("setPowerSave", 1, js_espnow_session_set_power_save),
    JS_CFUNC_DEF("recover", 0, js_espnow_session_recover),
    JS_CFUNC_DEF("close", 0, js_espnow_session_close),
    JS_PROP_END,
};

static const JSClassDef js_espnow_session_class =
    JS_CLASS_DEF("EspNowSession", 0, js_espnow_session_constructor,
                 JS_CLASS_ESPNOW_SESSION, NULL, js_espnow_session_proto, NULL,
                 js_espnow_session_finalizer);

static const JSPropDef js_espnow_peer_proto[] = {
    JS_CFUNC_DEF("status", 0, js_espnow_peer_status),
    JS_CFUNC_DEF("send", 2, js_espnow_peer_send),
    JS_CFUNC_DEF("enqueue", 1, js_espnow_peer_enqueue),
    JS_CFUNC_DEF("enqueueBatch", 1, js_espnow_peer_enqueue_batch),
    JS_CFUNC_DEF("update", 1, js_espnow_peer_update),
    JS_CFUNC_DEF("remove", 0, js_espnow_peer_remove),
    JS_PROP_END,
};

static const JSClassDef js_espnow_peer_class =
    JS_CLASS_DEF("EspNowPeer", 0, js_espnow_peer_constructor,
                 JS_CLASS_ESPNOW_PEER, NULL, js_espnow_peer_proto, NULL,
                 js_espnow_peer_finalizer);

static const JSPropDef js_espnow[] = {
    JS_PROP_STRING_DEF("BROADCAST_ADDRESS", "ff:ff:ff:ff:ff:ff", 0),
    JS_PROP_DOUBLE_DEF("MAX_PAYLOAD_V1", 250, 0),
    JS_PROP_DOUBLE_DEF("MAX_PAYLOAD_V2", 1470, 0),
    JS_CFUNC_DEF("capabilities", 0, js_espnow_capabilities),
    JS_CFUNC_DEF("open", 1, js_espnow_open),
    JS_PROP_END,
};

static const JSClassDef js_espnow_obj =
    JS_OBJECT_DEF("espNow", js_espnow);
#endif

#if CONFIG_ESP32_MQUICKJS_FEATURE_BLE
static const JSPropDef js_ble_adapter_proto[] = {
    JS_CFUNC_DEF("status", 0, js_ble_adapter_status),
    JS_CFUNC_DEF("scan", 1, js_ble_adapter_scan),
    JS_CFUNC_DEF("connect", 2, js_ble_adapter_connect),
    JS_CFUNC_DEF("advertise", 1, js_ble_adapter_advertise),
    JS_CFUNC_DEF("server", 0, js_ble_adapter_server),
    JS_CFUNC_DEF("bonds", 0, js_ble_adapter_bonds),
    JS_CFUNC_DEF("removeBond", 1, js_ble_adapter_remove_bond),
    JS_CFUNC_DEF("clearBonds", 0, js_ble_adapter_clear_bonds),
    JS_CFUNC_DEF("close", 0, js_ble_adapter_close),
    JS_PROP_END,
};

static const JSClassDef js_ble_adapter_class =
    JS_CLASS_DEF("BLEAdapter", 0, js_ble_adapter_constructor,
                 JS_CLASS_BLE_ADAPTER, NULL, js_ble_adapter_proto, NULL,
                 js_ble_adapter_finalizer);

static const JSPropDef js_ble_scanner_proto[] = {
    JS_CFUNC_DEF("receive", 1, js_ble_scanner_receive),
    JS_CFUNC_DEF("stats", 0, js_ble_scanner_stats),
    JS_CFUNC_DEF("status", 0, js_ble_scanner_status),
    JS_CFUNC_DEF("close", 0, js_ble_scanner_close),
    JS_PROP_END,
};

static const JSClassDef js_ble_scanner_class =
    JS_CLASS_DEF("BLEScanner", 0, js_ble_scanner_constructor,
                 JS_CLASS_BLE_SCANNER, NULL, js_ble_scanner_proto, NULL,
                 js_ble_scanner_finalizer);

static const JSPropDef js_ble_advertiser_proto[] = {
    JS_CFUNC_DEF("receive", 1, js_ble_advertiser_receive),
    JS_CFUNC_DEF("stats", 0, js_ble_advertiser_stats),
    JS_CFUNC_DEF("status", 0, js_ble_advertiser_status),
    JS_CFUNC_DEF("close", 0, js_ble_advertiser_close),
    JS_PROP_END,
};

static const JSClassDef js_ble_advertiser_class =
    JS_CLASS_DEF("BLEAdvertiser", 0, js_ble_advertiser_constructor,
                 JS_CLASS_BLE_ADVERTISER, NULL, js_ble_advertiser_proto, NULL,
                 js_ble_advertiser_finalizer);

static const JSPropDef js_ble_connection_proto[] = {
    JS_CFUNC_DEF("receive", 1, js_ble_connection_receive),
    JS_CFUNC_DEF("stats", 0, js_ble_connection_stats),
    JS_CFUNC_DEF("status", 0, js_ble_connection_status),
    JS_CFUNC_DEF("pair", 1, js_ble_connection_pair),
    JS_CFUNC_DEF("respondPairing", 2, js_ble_connection_respond_pairing),
    JS_CFUNC_DEF("exchangeMtu", 2, js_ble_connection_exchange_mtu),
    JS_CFUNC_DEF("readRssi", 1, js_ble_connection_read_rssi),
    JS_CFUNC_DEF("discover", 1, js_ble_connection_discover),
    JS_CFUNC_DEF("readHandle", 2, js_ble_connection_read_handle),
    JS_CFUNC_DEF("writeHandle", 3, js_ble_connection_write_handle),
    JS_CFUNC_DEF("subscribeHandle", 3,
                 js_ble_connection_subscribe_handle),
    JS_CFUNC_DEF("close", 0, js_ble_connection_close),
    JS_PROP_END,
};

static const JSClassDef js_ble_connection_class =
    JS_CLASS_DEF("BLEConnection", 0, js_ble_connection_constructor,
                 JS_CLASS_BLE_CONNECTION, NULL, js_ble_connection_proto, NULL,
                 js_ble_connection_finalizer);

static const JSPropDef js_ble_notification_proto[] = {
    JS_CFUNC_DEF("receive", 1, js_ble_notification_receive),
    JS_CFUNC_DEF("stats", 0, js_ble_notification_stats),
    JS_CFUNC_DEF("status", 0, js_ble_notification_status),
    JS_CFUNC_DEF("close", 0, js_ble_notification_close),
    JS_PROP_END,
};

static const JSClassDef js_ble_notification_class =
    JS_CLASS_DEF("BLENotificationStream", 0, js_ble_notification_constructor,
                 JS_CLASS_BLE_NOTIFICATION_STREAM, NULL,
                 js_ble_notification_proto, NULL,
                 js_ble_notification_finalizer);

static const JSPropDef js_ble_gatt_server_proto[] = {
    JS_CFUNC_DEF("status", 0, js_ble_gatt_server_status),
    JS_CFUNC_DEF("watch", 1, js_ble_gatt_server_watch),
    JS_CFUNC_DEF("characteristic", 1, js_ble_gatt_server_characteristic),
    JS_PROP_END,
};

