99percentpeople/esp32qjs/components/esp32_mquickjs/src/core/mqjs_stdlib_esp32.c
static const JSClassDef js_ble_gatt_server_class =
    JS_CLASS_DEF("BLEGattServer", 0, js_ble_gatt_server_constructor,
                 JS_CLASS_BLE_GATT_SERVER, NULL, js_ble_gatt_server_proto,
                 NULL, js_ble_gatt_server_finalizer);

static const JSPropDef js_ble_local_characteristic_proto[] = {
    JS_CFUNC_DEF("value", 0, js_ble_local_characteristic_value),
    JS_CFUNC_DEF("setValue", 1, js_ble_local_characteristic_set_value),
    JS_CFUNC_DEF("notify", 2, js_ble_local_characteristic_notify),
    JS_PROP_END,
};

static const JSClassDef js_ble_local_characteristic_class =
    JS_CLASS_DEF("BLELocalCharacteristic", 0,
                 js_ble_local_characteristic_constructor,
                 JS_CLASS_BLE_LOCAL_CHARACTERISTIC, NULL,
                 js_ble_local_characteristic_proto, NULL,
                 js_ble_local_characteristic_finalizer);

static const JSPropDef js_ble[] = {
    JS_CFUNC_DEF("capabilities", 0, js_ble_capabilities),
    JS_CFUNC_DEF("open", 1, js_ble_open),
    JS_PROP_END,
};

static const JSClassDef js_ble_obj = JS_OBJECT_DEF("ble", js_ble);
#endif

#if CONFIG_ESP32_MQUICKJS_FEATURE_I2S
static const JSPropDef js_i2s_channel_proto[] = {
    JS_CFUNC_DEF("start", 0, js_i2s_channel_start),
    JS_CFUNC_DEF("stop", 0, js_i2s_channel_stop),
    JS_CFUNC_DEF("read", 2, js_i2s_channel_read),
    JS_CFUNC_DEF("write", 2, js_i2s_channel_write),
    JS_CFUNC_DEF("status", 0, js_i2s_channel_status),
    JS_CFUNC_DEF("close", 0, js_i2s_channel_close),
    JS_PROP_END,
};

static const JSClassDef js_i2s_channel_class =
    JS_CLASS_DEF("I2SChannel", 0, js_i2s_channel_constructor,
                 JS_CLASS_I2S_CHANNEL, NULL, js_i2s_channel_proto, NULL,
                 js_i2s_channel_finalizer);

static const JSPropDef js_i2s[] = {
    JS_CFUNC_DEF("capabilities", 0, js_i2s_capabilities),
    JS_CFUNC_DEF("open", 1, js_i2s_open),
    JS_PROP_END,
};

static const JSClassDef js_i2s_obj = JS_OBJECT_DEF("i2s", js_i2s);
#endif

#if CONFIG_ESP32_MQUICKJS_FEATURE_CAMERA
static const JSPropDef js_camera_proto[] = {
    JS_CFUNC_DEF("capture", 1, js_camera_capture),
    JS_CFUNC_DEF("status", 0, js_camera_status),
    JS_CFUNC_DEF("controls", 0, js_camera_controls),
    JS_CFUNC_DEF("setControl", 2, js_camera_set_control),
    JS_CFUNC_DEF("close", 0, js_camera_close),
    JS_PROP_END,
};

static const JSClassDef js_camera_class =
    JS_CLASS_DEF("Camera", 0, js_camera_constructor, JS_CLASS_CAMERA,
                 NULL, js_camera_proto, NULL, js_camera_finalizer);

static const JSPropDef js_camera_frame_proto[] = {
    JS_CFUNC_DEF("source", 1, js_camera_frame_source),
    JS_CFUNC_DEF("read", 2, js_camera_frame_read),
    JS_CFUNC_DEF("close", 0, js_camera_frame_close),
    JS_PROP_END,
};

static const JSClassDef js_camera_frame_class =
    JS_CLASS_DEF("CameraFrame", 0, js_camera_frame_constructor,
                 JS_CLASS_CAMERA_FRAME, NULL, js_camera_frame_proto, NULL,
                 js_camera_frame_finalizer);

static const JSPropDef js_camera_module[] = {
    JS_CFUNC_DEF("capabilities", 0, js_camera_capabilities),
    JS_CFUNC_DEF("open", 1, js_camera_open),
    JS_PROP_END,
};

static const JSClassDef js_camera_obj =
    JS_OBJECT_DEF("camera", js_camera_module);
#endif

#if CONFIG_ESP32_MQUICKJS_FEATURE_USB_SERIAL
static const JSPropDef js_usb_serial_handle_proto[] = {
    JS_CFUNC_DEF("receive", 1, js_usb_serial_receive),
    JS_CFUNC_DEF("stats", 0, js_usb_serial_stats),
    JS_CFUNC_DEF("send", 1, js_usb_serial_send),
    JS_CFUNC_DEF("status", 0, js_usb_serial_status),
    JS_CFUNC_DEF("close", 0, js_usb_serial_close),
    JS_PROP_END,
};

static const JSClassDef js_usb_serial_handle_class =
    JS_CLASS_DEF("USBSerialHandle", 0, js_usb_serial_handle_constructor,
                 JS_CLASS_USB_SERIAL_HANDLE, NULL,
                 js_usb_serial_handle_proto, NULL,
                 js_usb_serial_handle_finalizer);

static const JSPropDef js_usb_serial[] = {
    JS_CFUNC_DEF("capabilities", 0, js_usb_serial_capabilities),
    JS_CFUNC_DEF("open", 1, js_usb_serial_open),
    JS_PROP_END,
};

static const JSClassDef js_usb_serial_obj =
    JS_OBJECT_DEF("usbSerial", js_usb_serial);
#endif

#if CONFIG_ESP32_MQUICKJS_FEATURE_RPC
static const JSPropDef js_rpc_codec_proto[] = {
    JS_CFUNC_DEF("createDecoder", 0, js_rpc_create_decoder),
    JS_CFUNC_DEF("encode", 4, js_rpc_encode),
    JS_CFUNC_DEF("close", 0, js_rpc_codec_close),
    JS_PROP_END,
};

static const JSClassDef js_rpc_codec_class =
    JS_CLASS_DEF("RPCCodec", 0, js_rpc_codec_constructor,
                 JS_CLASS_RPC_CODEC, NULL, js_rpc_codec_proto, NULL,
                 js_rpc_codec_finalizer);

static const JSPropDef js_rpc_decoder_proto[] = {
    JS_CFUNC_DEF("feed", 1, js_rpc_feed),
    JS_CFUNC_DEF("reset", 0, js_rpc_reset_decoder),
    JS_CFUNC_DEF("status", 0, js_rpc_decoder_status),
    JS_CFUNC_DEF("close", 0, js_rpc_decoder_close),
    JS_PROP_END,
};

static const JSClassDef js_rpc_decoder_class =
    JS_CLASS_DEF("RPCDecoder", 0, js_rpc_decoder_constructor,
                 JS_CLASS_RPC_DECODER, NULL, js_rpc_decoder_proto, NULL,
                 js_rpc_decoder_finalizer);

static const JSPropDef js_rpc[] = {
    JS_PROP_STRING_DEF("PROTOCOL", "esp32qjs.rpc/1", 0),
    JS_PROP_DOUBLE_DEF("RESPONSE", 4, 0),
    JS_PROP_DOUBLE_DEF("ERROR", 8, 0),
    JS_PROP_DOUBLE_DEF("MAX_FRAME_BYTES", 7740, 0),
    JS_PROP_DOUBLE_DEF("MAX_MESSAGE_BYTES", 65536, 0),
    JS_PROP_DOUBLE_DEF("MAX_STREAM_BYTES", 33554432, 0),
    JS_PROP_DOUBLE_DEF("SEGMENT_PAYLOAD_BYTES", 7680, 0),
    JS_CFUNC_DEF("createCodec", 1, js_rpc_create_codec),
    JS_CFUNC_DEF("bytes", 1, js_rpc_bytes),
    JS_CFUNC_DEF("fileSource", 1, js_rpc_file_source),
    JS_CFUNC_DEF("sourceInfo", 1, js_rpc_source_info),
    JS_CFUNC_DEF("adoptFile", 2, js_rpc_adopt_file),
    JS_CFUNC_DEF("status", 0, js_rpc_status),
    JS_PROP_END,
};

static const JSClassDef js_rpc_obj =
    JS_OBJECT_DEF("rpc", js_rpc);
#endif

#if CONFIG_ESP32_MQUICKJS_FEATURE_SOCKET
static const JSPropDef js_tcp_socket_proto[] = {
    JS_CFUNC_DEF("connect", 3, js_socket_tcp_connect),
    JS_CFUNC_DEF("send", 2, js_socket_tcp_send),
    JS_CFUNC_DEF("recv", 2, js_socket_tcp_recv),
    JS_CFUNC_DEF("status", 0, js_socket_handle_status),
    JS_CFUNC_DEF("close", 0, js_socket_handle_close),
    JS_PROP_END,
};

static const JSClassDef js_tcp_socket_class =
    JS_CLASS_DEF("TCPSocket", 0, js_socket_handle_constructor,
                 JS_CLASS_TCP_SOCKET, NULL, js_tcp_socket_proto, NULL,
                 js_socket_handle_finalizer);

