99percentpeople/esp32qjs/components/esp32_mquickjs/src/core/mqjs_stdlib_esp32.c
static const JSPropDef js_tcp_listener_proto[] = {
    JS_CFUNC_DEF("accept", 1, js_socket_tcp_accept),
    JS_CFUNC_DEF("status", 0, js_socket_handle_status),
    JS_CFUNC_DEF("close", 0, js_socket_handle_close),
    JS_PROP_END,
};

static const JSClassDef js_tcp_listener_class =
    JS_CLASS_DEF("TCPListener", 0, js_socket_handle_constructor,
                 JS_CLASS_TCP_LISTENER, NULL, js_tcp_listener_proto, NULL,
                 js_socket_handle_finalizer);

static const JSPropDef js_udp_socket_proto[] = {
    JS_CFUNC_DEF("sendTo", 3, js_socket_udp_send_to),
    JS_CFUNC_DEF("receiveFrom", 2, js_socket_udp_receive_from),
    JS_CFUNC_DEF("status", 0, js_socket_handle_status),
    JS_CFUNC_DEF("close", 0, js_socket_handle_close),
    JS_PROP_END,
};

static const JSClassDef js_udp_socket_class =
    JS_CLASS_DEF("UDPSocket", 0, js_socket_handle_constructor,
                 JS_CLASS_UDP_SOCKET, NULL, js_udp_socket_proto, NULL,
                 js_socket_handle_finalizer);

static const JSPropDef js_socket[] = {
    JS_CFUNC_DEF("openTCP", 1, js_socket_open_tcp),
    JS_CFUNC_DEF("listenTCP", 1, js_socket_listen_tcp),
    JS_CFUNC_DEF("openUDP", 1, js_socket_open_udp),
    JS_CGETSET_DEF("MAX_TRANSFER_BYTES", js_socket_get_max_transfer_bytes, NULL),
    JS_PROP_END,
};

static const JSClassDef js_socket_obj =
    JS_OBJECT_DEF("socket", js_socket);
#endif

#if CONFIG_ESP32_MQUICKJS_FEATURE_WEBSOCKET
static const JSPropDef js_websocket_handle_proto[] = {
    JS_CFUNC_DEF("receive", 1, js_websocket_receive),
    JS_CFUNC_DEF("stats", 0, js_websocket_stats),
    JS_CFUNC_DEF("send", 1, js_websocket_send),
    JS_CFUNC_DEF("status", 0, js_websocket_status),
    JS_CFUNC_DEF("close", 0, js_websocket_close),
    JS_PROP_END,
};

static const JSClassDef js_websocket_handle_class =
    JS_CLASS_DEF("WebSocketClientHandle", 0,
                 js_websocket_handle_constructor,
                 JS_CLASS_WEBSOCKET_CLIENT_HANDLE, NULL,
                 js_websocket_handle_proto, NULL,
                 js_websocket_handle_finalizer);

static const JSPropDef js_websocket_client[] = {
    JS_CFUNC_DEF("capabilities", 0, js_websocket_capabilities),
    JS_CFUNC_DEF("open", 1, js_websocket_open),
    JS_PROP_END,
};

static const JSClassDef js_websocket_client_obj =
    JS_OBJECT_DEF("websocketClient", js_websocket_client);
#endif

#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI
static const JSPropDef js_wifi_wake_lock_proto[] = {
    JS_CGETSET_DEF("acquired", js_wifi_wake_lock_acquired, NULL),
    JS_CFUNC_DEF("close", 0, js_wifi_wake_lock_close),
    JS_PROP_END,
};
static const JSClassDef js_wifi_wake_lock_class =
    JS_CLASS_DEF("WiFiWakeLock", 0, js_wifi_wake_lock_constructor,
                 JS_CLASS_WIFI_WAKE_LOCK, NULL, js_wifi_wake_lock_proto,
                 NULL, js_wifi_wake_lock_finalizer);

static const JSPropDef js_wifi_monitor_session_proto[] = {
    JS_CGETSET_DEF("_eventQueue", js_wifi_monitor_session_get_queue, NULL),
    JS_CFUNC_DEF("configure", 1, js_wifi_monitor_session_configure),
    JS_CFUNC_DEF("status", 0, js_wifi_monitor_session_status),
    JS_CFUNC_DEF("stats", 0, js_wifi_monitor_session_stats),
    JS_CFUNC_DEF("receive", 1, js_wifi_monitor_session_receive),
    JS_CFUNC_DEF("receiveBatch", 1, js_wifi_monitor_session_receive_batch),
    JS_CFUNC_DEF("start", 0, js_wifi_monitor_session_start),
    JS_CFUNC_DEF("stop", 0, js_wifi_monitor_session_stop),
    JS_CFUNC_DEF("close", 0, js_wifi_monitor_session_close),
    JS_PROP_END,
};
static const JSClassDef js_wifi_monitor_session_class =
    JS_CLASS_DEF("WiFiMonitorSession", 0, js_wifi_monitor_session_constructor,
                 JS_CLASS_WIFI_MONITOR_SESSION, NULL, js_wifi_monitor_session_proto,
                 NULL, js_wifi_monitor_session_finalizer);
static const JSPropDef js_wifi_monitor_frame_proto[] = {
    JS_CFUNC_DEF("bytes", 0, js_wifi_monitor_frame_bytes),
    JS_CFUNC_DEF("copyBytes", 0, js_wifi_monitor_frame_copy_bytes),
    JS_CFUNC_DEF("source", 0, js_wifi_monitor_frame_source),
    JS_CFUNC_DEF("close", 0, js_wifi_monitor_frame_close),
    JS_PROP_END,
};
static const JSClassDef js_wifi_monitor_frame_class =
    JS_CLASS_DEF("WiFiMonitorFrame", 0, js_wifi_monitor_frame_constructor,
                 JS_CLASS_WIFI_MONITOR_FRAME, NULL, js_wifi_monitor_frame_proto,
                 NULL, js_wifi_monitor_frame_finalizer);
static const JSPropDef js_wifi_monitor_batch_proto[] = {
    JS_CFUNC_DEF("info", 1, js_wifi_monitor_batch_info),
    JS_CFUNC_DEF("bytes", 1, js_wifi_monitor_batch_bytes),
    JS_CFUNC_DEF("source", 1, js_wifi_monitor_batch_source),
    JS_CFUNC_DEF("close", 0, js_wifi_monitor_batch_close),
    JS_PROP_END,
};
static const JSClassDef js_wifi_monitor_batch_class =
    JS_CLASS_DEF("WiFiMonitorBatch", 0, js_wifi_monitor_batch_constructor,
                 JS_CLASS_WIFI_MONITOR_BATCH, NULL, js_wifi_monitor_batch_proto,
                 NULL, js_wifi_monitor_batch_finalizer);
static const JSPropDef js_wifi_monitor[] = {
    JS_CFUNC_DEF("capabilities", 0, js_wifi_monitor_capabilities),
    JS_CFUNC_DEF("open", 1, js_wifi_monitor_open),
    JS_PROP_END,
};
static const JSClassDef js_wifi_monitor_obj = JS_OBJECT_DEF("monitor", js_wifi_monitor);

static const JSPropDef js_wifi_raw_tx_session_proto[] = {
    JS_CFUNC_DEF("startPeriodic", 1, js_wifi_raw_tx_start_periodic),
    JS_CFUNC_DEF("send", 2, js_wifi_raw_tx_session_send),
    JS_CFUNC_DEF("enqueue", 1, js_wifi_raw_tx_session_enqueue),
    JS_CFUNC_DEF("enqueueBatch", 1, js_wifi_raw_tx_session_enqueue_batch),
    JS_CFUNC_DEF("flush", 1, js_wifi_raw_tx_session_flush),
    JS_CFUNC_DEF("waitWritable", 1, js_wifi_raw_tx_session_wait_writable),
    JS_CFUNC_DEF("status", 0, js_wifi_raw_tx_session_status),
    JS_CFUNC_DEF("stats", 0, js_wifi_raw_tx_session_stats),
    JS_CFUNC_DEF("close", 0, js_wifi_raw_tx_session_close),
    JS_PROP_END,
};
static const JSClassDef js_wifi_raw_tx_session_class =
    JS_CLASS_DEF("WiFiRawTxSession", 0, js_wifi_raw_tx_session_constructor,
                 JS_CLASS_WIFI_RAW_TX_SESSION, NULL, js_wifi_raw_tx_session_proto,
                 NULL, js_wifi_raw_tx_session_finalizer);
static const JSPropDef js_wifi_raw_periodic_proto[] = {
    JS_CFUNC_DEF("status", 0, js_wifi_raw_periodic_status),
    JS_CFUNC_DEF("stop", 0, js_wifi_raw_periodic_stop),
    JS_CFUNC_DEF("close", 0, js_wifi_raw_periodic_close),
    JS_PROP_END,
};
static const JSClassDef js_wifi_raw_periodic_class =
    JS_CLASS_DEF("WiFiRawPeriodicTx", 0, js_wifi_raw_periodic_constructor,
                 JS_CLASS_WIFI_RAW_PERIODIC_TX, NULL, js_wifi_raw_periodic_proto,
                 NULL, js_wifi_raw_periodic_finalizer);
#if CONFIG_ESP_WIFI_FTM_ENABLE && CONFIG_ESP_WIFI_FTM_INITIATOR_SUPPORT
static const JSPropDef js_wifi_ftm_proto[] = {
    JS_CFUNC_DEF("status", 0, js_wifi_ftm_status),
    JS_CFUNC_DEF("receive", 1, js_wifi_ftm_receive),
    JS_CFUNC_DEF("end", 1, js_wifi_ftm_end),
    JS_CFUNC_DEF("close", 1, js_wifi_ftm_close),
    JS_PROP_END,
};
