99percentpeople/esp32qjs/components/esp32_mquickjs/src/core/mqjs_stdlib_esp32.c
static const JSClassDef js_wifi_ftm_class =
    JS_CLASS_DEF("WiFiFtmSession", 0, js_wifi_ftm_constructor,
                 JS_CLASS_WIFI_FTM_SESSION, NULL, js_wifi_ftm_proto, NULL, js_wifi_ftm_finalizer);
#endif
#if CONFIG_ESP_WIFI_FTM_ENABLE && (CONFIG_ESP_WIFI_FTM_INITIATOR_SUPPORT || (CONFIG_ESP_WIFI_FTM_RESPONDER_SUPPORT && CONFIG_ESP_WIFI_SOFTAP_SUPPORT))
static const JSPropDef js_wifi_ftm[] = {
    JS_CFUNC_DEF("capabilities", 0, js_wifi_ftm_capabilities),
#if CONFIG_ESP_WIFI_FTM_INITIATOR_SUPPORT
    JS_CFUNC_DEF("start", 1, js_wifi_ftm_start),
    JS_CFUNC_DEF("status", 0, js_wifi_ftm_global_status),
    JS_CFUNC_DEF("recover", 1, js_wifi_ftm_recover),
#endif
#if CONFIG_ESP_WIFI_FTM_RESPONDER_SUPPORT && CONFIG_ESP_WIFI_SOFTAP_SUPPORT
    JS_CFUNC_DEF("setResponderOffsetCm", 1, js_wifi_ftm_set_responder_offset),
    JS_CFUNC_DEF("responderOffsetStatus", 0, js_wifi_ftm_responder_offset_status),
#endif
    JS_PROP_END,
};
static const JSClassDef js_wifi_ftm_obj = JS_OBJECT_DEF("ftm", js_wifi_ftm);
#endif
static const JSPropDef js_wifi_roc_proto[] = {
    JS_CFUNC_DEF("status", 0, js_wifi_roc_status),
    JS_CFUNC_DEF("wait", 1, js_wifi_roc_wait),
    JS_CFUNC_DEF("close", 1, js_wifi_roc_close),
    JS_PROP_END,
};
static const JSClassDef js_wifi_roc_class =
    JS_CLASS_DEF("WiFiRocSession", 0, js_wifi_roc_constructor,
                 JS_CLASS_WIFI_ROC_SESSION, NULL, js_wifi_roc_proto, NULL, js_wifi_roc_finalizer);
static const JSPropDef js_wifi_action[] = {
    JS_CFUNC_DEF("recover", 1, js_wifi_action_recover),
    JS_CFUNC_DEF("remainOnChannel", 1, js_wifi_action_remain_on_channel),
    JS_CFUNC_DEF("capabilities", 0, js_wifi_action_capabilities),
    JS_CFUNC_DEF("send", 1, js_wifi_action_send),
    JS_CFUNC_DEF("status", 0, js_wifi_action_status),
    JS_PROP_END,
};
static const JSClassDef js_wifi_action_obj = JS_OBJECT_DEF("action", js_wifi_action);

static const JSPropDef js_wifi_raw_tx[] = {
    JS_CFUNC_DEF("capabilities", 0, js_wifi_raw_tx_capabilities),
    JS_CFUNC_DEF("send", 2, js_wifi_raw_tx_send),
    JS_CFUNC_DEF("open", 1, js_wifi_raw_tx_open),
    JS_CFUNC_DEF("recover", 1, js_wifi_raw_tx_recover),
    JS_PROP_END,
};
static const JSClassDef js_wifi_raw_tx_obj = JS_OBJECT_DEF("rawTx", js_wifi_raw_tx);

static const JSPropDef js_wifi_vendor_ie[] = {
    JS_CFUNC_DEF("watch", 1, js_wifi_vendor_ie_watch),
    JS_CFUNC_DEF("set", 1, js_wifi_vendor_ie_set),
    JS_CFUNC_DEF("clear", 1, js_wifi_vendor_ie_clear),
    JS_CFUNC_DEF("status", 0, js_wifi_vendor_ie_status),
    JS_PROP_END,
};
static const JSClassDef js_wifi_vendor_ie_obj = JS_OBJECT_DEF("vendorIe", js_wifi_vendor_ie);

static const JSPropDef js_wifi_driver[] = {
    JS_CFUNC_DEF("restore", 0, js_wifi_driver_restore),
    JS_CFUNC_DEF("capabilities", 0, js_wifi_driver_capabilities),
    JS_CFUNC_DEF("status", 0, js_wifi_driver_status),
    JS_CFUNC_DEF("restart", 1, js_wifi_driver_restart),
    JS_CFUNC_DEF("setDynamicCarrierSense", 1, js_wifi_driver_set_dynamic_carrier_sense),
    JS_CFUNC_DEF("setBssColorCollisionReporting", 1, js_wifi_driver_set_bss_color_collision_reporting),
    JS_CFUNC_DEF("configure11bRate", 2, js_wifi_driver_configure_11b_rate),
    JS_CFUNC_DEF("setCoexistencePowerManagement", 1, js_wifi_driver_set_coexistence_power_management),
    JS_CFUNC_DEF("getEventMask", 0, js_wifi_driver_get_event_mask),
    JS_CFUNC_DEF("setEventMask", 1, js_wifi_driver_set_event_mask),
    JS_CFUNC_DEF("setStorage", 1, js_wifi_driver_set_storage),
    JS_CFUNC_DEF("disablePmf", 1, js_wifi_driver_disable_pmf),
    JS_CFUNC_DEF("setMode", 1, js_wifi_driver_set_mode),
    JS_CFUNC_DEF("getAntenna", 0, js_wifi_driver_get_antenna),
    JS_CFUNC_DEF("getAntennaGpio", 0, js_wifi_driver_get_antenna_gpio),
    JS_CFUNC_DEF("setAntenna", 1, js_wifi_driver_set_antenna),
    JS_CFUNC_DEF("setAntennaGpio", 1, js_wifi_driver_set_antenna_gpio),
    JS_CFUNC_DEF("setConnectionlessWakeInterval", 1, js_wifi_driver_set_connectionless_wake_interval),
    JS_CFUNC_DEF("getMode", 0, js_wifi_driver_get_mode),
    JS_CFUNC_DEF("getCountry", 0, js_wifi_driver_get_country),
    JS_CFUNC_DEF("setCountryDetails", 1, js_wifi_driver_set_country_details),
    JS_CFUNC_DEF("getInterfaceConfig", 1, js_wifi_driver_get_interface_config),
    JS_CFUNC_DEF("setInterfaceConfig", 2, js_wifi_driver_set_interface_config),
    JS_CFUNC_DEF("getChannel", 0, js_wifi_driver_get_channel),
    JS_CFUNC_DEF("getHomeChannel", 0, js_wifi_driver_get_home_channel),
    JS_CFUNC_DEF("getBand", 0, js_wifi_driver_get_band),
    JS_CFUNC_DEF("getBandMode", 0, js_wifi_driver_get_band_mode),
    JS_CFUNC_DEF("setBand", 1, js_wifi_driver_set_band),
    JS_CFUNC_DEF("setBandMode", 1, js_wifi_driver_set_band_mode),
    JS_CFUNC_DEF("getPowerSave", 0, js_wifi_driver_get_power_save),
    JS_CFUNC_DEF("getTxPower", 0, js_wifi_driver_get_tx_power),
    JS_CFUNC_DEF("getRssi", 0, js_wifi_driver_get_rssi),
    JS_CFUNC_DEF("getAid", 0, js_wifi_driver_get_aid),
    JS_CFUNC_DEF("getNegotiatedPhy", 0, js_wifi_driver_get_negotiated_phy),
    JS_CFUNC_DEF("getTsfTime", 1, js_wifi_driver_get_tsf_time),
    JS_CFUNC_DEF("getInactiveTime", 1, js_wifi_driver_get_inactive_time),
    JS_CFUNC_DEF("setInactiveTime", 2, js_wifi_driver_set_inactive_time),
    JS_CFUNC_DEF("getScanParameters", 0, js_wifi_driver_get_scan_parameters),
    JS_CFUNC_DEF("getStatisticsConfig", 0, js_wifi_driver_get_statistics_config),
    JS_CFUNC_DEF("configureRxStatistics", 1, js_wifi_driver_configure_rx_statistics),
    JS_CFUNC_DEF("setTxStatistics", 2, js_wifi_driver_set_tx_statistics),
    JS_CFUNC_DEF("setScanParameters", 1, js_wifi_driver_set_scan_parameters),
    JS_CFUNC_DEF("setRssiThreshold", 1, js_wifi_driver_set_rssi_threshold),
    JS_CFUNC_DEF("getProtocol", 1, js_wifi_driver_get_protocol),
    JS_CFUNC_DEF("getProtocols", 1, js_wifi_driver_get_protocols),
    JS_CFUNC_DEF("getBandwidth", 1, js_wifi_driver_get_bandwidth),
    JS_CFUNC_DEF("getBandwidths", 1, js_wifi_driver_get_bandwidths),
    JS_CFUNC_DEF("setProtocol", 2, js_wifi_driver_set_protocol),
    JS_CFUNC_DEF("setProtocols", 2, js_wifi_driver_set_protocols),
    JS_CFUNC_DEF("setBandwidth", 2, js_wifi_driver_set_bandwidth),
    JS_CFUNC_DEF("setBandwidths", 2, js_wifi_driver_set_bandwidths),
    JS_CFUNC_DEF("configureTxRate", 2, js_wifi_driver_configure_tx_rate),
    JS_CFUNC_DEF("txRateStatus", 1, js_wifi_driver_tx_rate_status),
    JS_PROP_END,
};
static const JSClassDef js_wifi_driver_obj = JS_OBJECT_DEF("driver", js_wifi_driver);

