99percentpeople/esp32qjs/components/esp32_mquickjs/src/core/mqjs_stdlib_esp32.c
#if CONFIG_ESP_WIFI_RRM_SUPPORT || CONFIG_ESP_WIFI_WNM_SUPPORT || CONFIG_ESP_WIFI_11R_SUPPORT
#if CONFIG_ESP_WIFI_RRM_SUPPORT
static const JSPropDef js_wifi_neighbor_proto[] = {
    JS_CFUNC_DEF("status", 0, js_wifi_neighbor_status),
    JS_CFUNC_DEF("receive", 1, js_wifi_neighbor_receive),
    JS_CFUNC_DEF("cancel", 0, js_wifi_neighbor_cancel),
    JS_CFUNC_DEF("close", 0, js_wifi_neighbor_close),
    JS_PROP_END,
};
static const JSClassDef js_wifi_neighbor_class =
    JS_CLASS_DEF("WiFiNeighborReportRequest", 0, js_wifi_neighbor_constructor,
                 JS_CLASS_WIFI_NEIGHBOR_REQUEST, NULL, js_wifi_neighbor_proto, NULL, js_wifi_neighbor_finalizer);
#endif
static const JSPropDef js_wifi_roaming[] = {
    JS_CFUNC_DEF("watch", 1, js_wifi_roaming_watch),
    JS_CFUNC_DEF("capabilities", 0, js_wifi_roaming_capabilities),
#if CONFIG_ESP_WIFI_RRM_SUPPORT
    JS_CFUNC_DEF("isRrmSupported", 0, js_wifi_roaming_is_rrm_supported),
    JS_CFUNC_DEF("requestNeighborReport", 1, js_wifi_neighbor_request),
    JS_CFUNC_DEF("status", 0, js_wifi_neighbor_module_status),
#endif
#if CONFIG_ESP_WIFI_WNM_SUPPORT
    JS_CFUNC_DEF("isBtmSupported", 0, js_wifi_roaming_is_btm_supported),
    JS_CFUNC_DEF("sendBtmQuery", 1, js_wifi_roaming_send_btm_query),
#endif
    JS_PROP_END,
};
static const JSClassDef js_wifi_roaming_obj = JS_OBJECT_DEF("roaming", js_wifi_roaming);
#endif
#if CONFIG_ESP_WIFI_ENTERPRISE_SUPPORT
static const JSPropDef js_wifi_enterprise[] = {
    JS_CFUNC_DEF("capabilities", 0, js_wifi_enterprise_capabilities),
    JS_CFUNC_DEF("configure", 1, js_wifi_enterprise_configure),
    JS_CFUNC_DEF("status", 0, js_wifi_enterprise_status),
    JS_CFUNC_DEF("enable", 1, js_wifi_enterprise_enable),
    JS_CFUNC_DEF("disable", 1, js_wifi_enterprise_disable),
    JS_CFUNC_DEF("clear", 1, js_wifi_enterprise_clear),
    JS_PROP_END,
};
static const JSClassDef js_wifi_enterprise_obj = JS_OBJECT_DEF("enterprise", js_wifi_enterprise);
#endif
#if CONFIG_SOC_WIFI_HE_SUPPORT && CONFIG_IDF_TARGET_ESP32C5
static const JSPropDef js_wifi_twt_agreement_proto[] = {
    JS_CFUNC_DEF("status", 0, js_wifi_twt_agreement_status),
    JS_CFUNC_DEF("close", 1, js_wifi_twt_agreement_close),
    JS_CFUNC_DEF("suspend", 1, js_wifi_twt_agreement_suspend),
    JS_CFUNC_DEF("resume", 1, js_wifi_twt_agreement_resume),
    JS_PROP_END,
};
static const JSClassDef js_wifi_twt_agreement_class =
    JS_CLASS_DEF("WiFiTwtAgreement", 0, js_wifi_twt_agreement_constructor,
        JS_CLASS_WIFI_TWT_AGREEMENT, NULL, js_wifi_twt_agreement_proto, NULL, js_wifi_twt_agreement_finalizer);
static const JSPropDef js_wifi_twt[] = {
    JS_CFUNC_DEF("getConfig", 0, js_wifi_twt_get_config),
    JS_CFUNC_DEF("configure", 1, js_wifi_twt_configure),
    JS_CFUNC_DEF("getFlowStatus", 0, js_wifi_twt_get_flow_status),
    JS_CFUNC_DEF("setTargetWakeTimeOffset", 1, js_wifi_twt_set_target_wake_time_offset),
    JS_CFUNC_DEF("capabilities", 0, js_wifi_twt_capabilities),
    JS_CFUNC_DEF("status", 0, js_wifi_twt_status),
    JS_CFUNC_DEF("probe", 1, js_wifi_twt_probe),
    JS_CFUNC_DEF("broadcasts", 1, js_wifi_twt_broadcasts),
    JS_CFUNC_DEF("setupIndividual", 1, js_wifi_twt_setup_individual),
    JS_CFUNC_DEF("setupBroadcast", 1, js_wifi_twt_setup_broadcast),
    JS_CFUNC_DEF("agreements", 0, js_wifi_twt_agreements),
    JS_CFUNC_DEF("closeAll", 1, js_wifi_twt_close_all),
    JS_CFUNC_DEF("recover", 1, js_wifi_twt_recover),
    JS_PROP_END,
};
static const JSClassDef js_wifi_twt_obj = JS_OBJECT_DEF("twt", js_wifi_twt);
#endif
#if CONFIG_ESP_NETIF_USES_TCPIP_WITH_BSD_API && CONFIG_LWIP_IPV4
static const JSPropDef js_wifi_smartconfig_proto[] = {
    JS_CFUNC_DEF("status", 0, js_wifi_smartconfig_status),
    JS_CFUNC_DEF("watch", 1, js_wifi_smartconfig_watch),
    JS_CFUNC_DEF("receive", 1, js_wifi_smartconfig_receive),
    JS_CFUNC_DEF("close", 1, js_wifi_smartconfig_close),
    JS_PROP_END,
};
static const JSClassDef js_wifi_smartconfig_class =
    JS_CLASS_DEF("WiFiSmartConfigSession", 0, js_wifi_smartconfig_constructor,
        JS_CLASS_WIFI_SMARTCONFIG_SESSION, NULL, js_wifi_smartconfig_proto, NULL, js_wifi_smartconfig_finalizer);
static const JSPropDef js_wifi_smartconfig[] = {
    JS_CFUNC_DEF("capabilities", 0, js_wifi_smartconfig_capabilities),
    JS_CFUNC_DEF("status", 0, js_wifi_smartconfig_global_status),
    JS_CFUNC_DEF("start", 1, js_wifi_smartconfig_start),
    JS_PROP_END,
};
static const JSClassDef js_wifi_smartconfig_obj = JS_OBJECT_DEF("smartConfig", js_wifi_smartconfig);
static const JSPropDef js_wifi_wps_proto[] = {
    JS_CFUNC_DEF("status", 0, js_wifi_wps_status),
    JS_CFUNC_DEF("watch", 1, js_wifi_wps_watch),
    JS_CFUNC_DEF("receive", 1, js_wifi_wps_receive),
    JS_CFUNC_DEF("close", 1, js_wifi_wps_close),
    JS_CFUNC_DEF("cancel", 0, js_wifi_wps_cancel),
    JS_PROP_END,
};
static const JSClassDef js_wifi_wps_class =
    JS_CLASS_DEF("WiFiWpsSession", 0, js_wifi_wps_constructor,
        JS_CLASS_WIFI_WPS_SESSION, NULL, js_wifi_wps_proto, NULL, js_wifi_wps_finalizer);
#if CONFIG_ESP_WIFI_WPS_SOFTAP_REGISTRAR
static const JSPropDef js_wifi_wps_ap_proto[] = {
    JS_CFUNC_DEF("status", 0, js_wifi_wps_ap_status),
    JS_CFUNC_DEF("watch", 1, js_wifi_wps_ap_watch),
    JS_CFUNC_DEF("receive", 1, js_wifi_wps_ap_receive),
    JS_CFUNC_DEF("close", 1, js_wifi_wps_ap_close),
    JS_CFUNC_DEF("cancel", 0, js_wifi_wps_ap_cancel),
    JS_PROP_END,
};
static const JSClassDef js_wifi_wps_ap_class =
    JS_CLASS_DEF("WiFiWpsAPSession", 0, js_wifi_wps_ap_constructor,
        JS_CLASS_WIFI_WPS_AP_SESSION, NULL, js_wifi_wps_ap_proto, NULL, js_wifi_wps_ap_finalizer);
#endif
static const JSPropDef js_wifi_wps[] = {
    JS_CFUNC_DEF("capabilities", 0, js_wifi_wps_capabilities),
    JS_CFUNC_DEF("status", 0, js_wifi_wps_global_status),
    JS_CFUNC_DEF("start", 1, js_wifi_wps_start),
#if CONFIG_ESP_WIFI_WPS_SOFTAP_REGISTRAR
    JS_CFUNC_DEF("startAP", 1, js_wifi_wps_ap_start),
    JS_CFUNC_DEF("apStatus", 0, js_wifi_wps_ap_global_status),
#endif
    JS_PROP_END,
};
static const JSClassDef js_wifi_wps_obj = JS_OBJECT_DEF("wps", js_wifi_wps);
#if CONFIG_ESP_WIFI_DPP_SUPPORT
static const JSPropDef js_wifi_dpp_proto[] = {
    JS_CFUNC_DEF("status", 0, js_wifi_dpp_status),
    JS_CFUNC_DEF("watch", 1, js_wifi_dpp_watch),
    JS_CFUNC_DEF("receive", 1, js_wifi_dpp_receive),
    JS_CFUNC_DEF("connect", 2, js_wifi_dpp_connect),
    JS_CFUNC_DEF("recover", 0, js_wifi_dpp_recover),
    JS_CFUNC_DEF("close", 1, js_wifi_dpp_close),
    JS_CFUNC_DEF("cancel", 0, js_wifi_dpp_cancel),
    JS_PROP_END,
};
static const JSClassDef js_wifi_dpp_class =
    JS_CLASS_DEF("WiFiDppSession", 0, js_wifi_dpp_constructor,
        JS_CLASS_WIFI_DPP_SESSION, NULL, js_wifi_dpp_proto, NULL, js_wifi_dpp_finalizer);
static const JSPropDef js_wifi_dpp[] = {
    JS_CFUNC_DEF("capabilities", 0, js_wifi_dpp_capabilities),
    JS_CFUNC_DEF("status", 0, js_wifi_dpp_global_status),
    JS_CFUNC_DEF("startEnrollee", 1, js_wifi_dpp_start),
    JS_PROP_END,
};
