99percentpeople/esp32qjs/components/esp32_mquickjs/src/core/mqjs_stdlib_esp32.c
static const JSClassDef js_wifi_dpp_obj = JS_OBJECT_DEF("dpp", js_wifi_dpp);
#endif
#endif

#if CONFIG_ESP_WIFI_NAN_SYNC_ENABLE || CONFIG_ESP_WIFI_NAN_USD_ENABLE
static const JSPropDef js_wifi_nan_proto[] = {
#if CONFIG_ESP_WIFI_NAN_SYNC_ENABLE
    JS_CFUNC_DEF("getServiceInfo", 1, js_wifi_nan_get_service_info),
    JS_CFUNC_DEF("getPeerInfo", 2, js_wifi_nan_get_peer_info),
    JS_CFUNC_DEF("getPeerRecords", 1, js_wifi_nan_get_peer_records),
#endif
    JS_CFUNC_DEF("publish", 1, js_wifi_nan_publish),
    JS_CFUNC_DEF("subscribe", 1, js_wifi_nan_subscribe),
    JS_CFUNC_DEF("status", 0, js_wifi_nan_status),
    JS_CFUNC_DEF("ready", 1, js_wifi_nan_ready),
    JS_CFUNC_DEF("close", 1, js_wifi_nan_close),
    JS_CFUNC_DEF("cancel", 0, js_wifi_nan_cancel),
    JS_PROP_END,
};
static const JSClassDef js_wifi_nan_class =
    JS_CLASS_DEF("WiFiNanSession", 0, js_wifi_nan_constructor,
        JS_CLASS_WIFI_NAN_SESSION, NULL, js_wifi_nan_proto, NULL, js_wifi_nan_finalizer);
static const JSPropDef js_wifi_nan_service_proto[] = {
#if CONFIG_ESP_WIFI_NAN_PAIRING
    JS_CFUNC_DEF("preparePairing", 1, js_wifi_nan_pairing_prepare),
    JS_CFUNC_DEF("requestPairing", 1, js_wifi_nan_pairing_request),
    JS_CFUNC_DEF("receivePairing", 1, js_wifi_nan_pairing_receive),
    JS_CFUNC_DEF("pairingCredentials", 1, js_wifi_nan_pairing_credentials),
#endif
#if CONFIG_ESP_WIFI_NAN_SYNC_ENABLE
    JS_CFUNC_DEF("requestDataPath", 1, js_wifi_nan_path_request),
    JS_CFUNC_DEF("receiveDataPath", 1, js_wifi_nan_path_receive),
#endif
    JS_CFUNC_DEF("status", 0, js_wifi_nan_service_status),
    JS_CFUNC_DEF("ready", 1, js_wifi_nan_service_ready),
    JS_CFUNC_DEF("send", 1, js_wifi_nan_service_send),
    JS_CFUNC_DEF("close", 1, js_wifi_nan_service_close),
    JS_CFUNC_DEF("cancel", 0, js_wifi_nan_service_cancel),
    JS_PROP_END,
};
static const JSClassDef js_wifi_nan_service_class =
    JS_CLASS_DEF("WiFiNanService", 0, js_wifi_nan_service_constructor,
        JS_CLASS_WIFI_NAN_SERVICE, NULL, js_wifi_nan_service_proto, NULL, js_wifi_nan_service_finalizer);
#if CONFIG_ESP_WIFI_NAN_SYNC_ENABLE
static const JSPropDef js_wifi_nan_path_proto[] = {
    JS_CFUNC_DEF("status", 0, js_wifi_nan_path_status),
    JS_CFUNC_DEF("ready", 1, js_wifi_nan_path_ready),
    JS_CFUNC_DEF("respond", 1, js_wifi_nan_path_respond),
    JS_CFUNC_DEF("close", 1, js_wifi_nan_path_close),
    JS_CFUNC_DEF("cancel", 0, js_wifi_nan_path_cancel),
    JS_PROP_END,
};
static const JSClassDef js_wifi_nan_path_class =
    JS_CLASS_DEF("WiFiNanDataPath", 0, js_wifi_nan_path_constructor,
        JS_CLASS_WIFI_NAN_PATH, NULL, js_wifi_nan_path_proto, NULL, js_wifi_nan_path_finalizer);
#endif
#if CONFIG_ESP_WIFI_NAN_PAIRING
static const JSPropDef js_wifi_nan_pairing_proto[] = {
    JS_CFUNC_DEF("status", 0, js_wifi_nan_pairing_status),
    JS_CFUNC_DEF("confirm", 1, js_wifi_nan_pairing_confirm),
    JS_CFUNC_DEF("ready", 1, js_wifi_nan_pairing_ready),
    JS_CFUNC_DEF("close", 1, js_wifi_nan_pairing_close),
    JS_CFUNC_DEF("cancel", 0, js_wifi_nan_pairing_cancel),
    JS_PROP_END,
};
static const JSClassDef js_wifi_nan_pairing_class =
    JS_CLASS_DEF("WiFiNanPairing", 0, js_wifi_nan_pairing_constructor,
        JS_CLASS_WIFI_NAN_PAIRING, NULL, js_wifi_nan_pairing_proto, NULL, js_wifi_nan_pairing_finalizer);
#endif
static const JSPropDef js_wifi_nan[] = {
    JS_CFUNC_DEF("capabilities", 0, js_wifi_nan_capabilities),
    JS_CFUNC_DEF("status", 0, js_wifi_nan_global_status),
    JS_CFUNC_DEF("open", 1, js_wifi_nan_open),
    JS_PROP_END,
};
static const JSClassDef js_wifi_nan_obj = JS_OBJECT_DEF("nan", js_wifi_nan);
#endif

static const JSPropDef js_wifi_diagnostics[] = {
    JS_CFUNC_DEF("snapshot", 0, js_wifi_diagnostics_snapshot),
    JS_CFUNC_DEF("dumpDriverStats", 1, js_wifi_diagnostics_dump_driver_stats),
    JS_CFUNC_DEF("idfApiCoverage", 0, js_wifi_diagnostics_idf_api_coverage),
    JS_CFUNC_DEF("resetFrameworkCounters", 0, js_wifi_diagnostics_reset_counters),
    JS_PROP_END,
};
static const JSClassDef js_wifi_diagnostics_obj = JS_OBJECT_DEF("diagnostics", js_wifi_diagnostics);

#if CONFIG_ESP_WIFI_WAPI_PSK
static const JSPropDef js_wifi_wapi[] = {
    JS_CFUNC_DEF("capabilities", 0, js_wifi_wapi_capabilities),
    JS_CFUNC_DEF("status", 0, js_wifi_wapi_status),
    JS_CFUNC_DEF("enable", 1, js_wifi_wapi_enable),
    JS_CFUNC_DEF("disable", 1, js_wifi_wapi_disable),
    JS_PROP_END,
};
static const JSClassDef js_wifi_wapi_obj = JS_OBJECT_DEF("wapi", js_wifi_wapi);
#endif

#if ESP32_MQUICKJS_WIFI_MESH_AVAILABLE
static const JSPropDef js_wifi_mesh_proto[] = {
    JS_CFUNC_DEF("ready", 1, js_wifi_mesh_ready),
    JS_CFUNC_DEF("close", 1, js_wifi_mesh_close),
    JS_CFUNC_DEF("recover", 1, js_wifi_mesh_recover),
    JS_CFUNC_DEF("receive", 1, js_wifi_mesh_receive),
    JS_CFUNC_DEF("send", 1, js_wifi_mesh_send),
    JS_CFUNC_DEF("routingTable", 1, js_wifi_mesh_routing_table),
    JS_CFUNC_DEF("groups", 1, js_wifi_mesh_groups),
    JS_CFUNC_DEF("addGroups", 1, js_wifi_mesh_add_groups),
    JS_CFUNC_DEF("removeGroups", 1, js_wifi_mesh_remove_groups),
    JS_CFUNC_DEF("setToDSState", 1, js_wifi_mesh_set_tods),
    JS_CFUNC_DEF("connect", 1, js_wifi_mesh_connect),
    JS_CFUNC_DEF("disconnect", 1, js_wifi_mesh_disconnect),
    JS_CFUNC_DEF("flushUpstream", 1, js_wifi_mesh_flush_upstream),
    JS_CFUNC_DEF("configuration", 1, js_wifi_mesh_configuration),
    JS_CFUNC_DEF("setRouter", 1, js_wifi_mesh_set_router),
    JS_CFUNC_DEF("setMeshId", 1, js_wifi_mesh_set_mesh_id),
    JS_CFUNC_DEF("setType", 1, js_wifi_mesh_set_type),
    JS_CFUNC_DEF("setSelfOrganized", 1, js_wifi_mesh_set_self_organized),
    JS_CFUNC_DEF("setFixedRoot", 1, js_wifi_mesh_set_fixed_root),
    JS_CFUNC_DEF("setRootConflicts", 1, js_wifi_mesh_set_root_conflicts),
    JS_CFUNC_DEF("setAssociationExpiry", 1, js_wifi_mesh_set_association_expiry),
    JS_CFUNC_DEF("setRootHealingDelay", 1, js_wifi_mesh_set_root_healing_delay),
    JS_CFUNC_DEF("setIEEncryption", 1, js_wifi_mesh_set_ie_encryption),
    JS_CFUNC_DEF("waiveRoot", 1, js_wifi_mesh_waive_root),
    JS_CFUNC_DEF("switchChannel", 1, js_wifi_mesh_switch_channel),
    JS_CFUNC_DEF("setDeviceDuty", 1, js_wifi_mesh_set_device_duty),
    JS_CFUNC_DEF("setNetworkDuty", 1, js_wifi_mesh_set_network_duty),
    JS_CFUNC_DEF("signalDuty", 1, js_wifi_mesh_signal_duty),
    JS_CFUNC_DEF("subnet", 1, js_wifi_mesh_subnet),
    JS_CFUNC_DEF("hasGroup", 1, js_wifi_mesh_has_group),
    JS_CFUNC_DEF("upstreamCapacity", 1, js_wifi_mesh_upstream_capacity),
    JS_CFUNC_DEF("powerStatus", 1, js_wifi_mesh_power_status),
    JS_CFUNC_DEF("tsfTime", 1, js_wifi_mesh_tsf_time),
    JS_CFUNC_DEF("setParent", 1, js_wifi_mesh_set_parent),
    JS_CFUNC_DEF("scan", 1, js_wifi_mesh_scan),
    JS_CFUNC_DEF("receiveScan", 1, js_wifi_mesh_receive_scan),
    JS_CFUNC_DEF("flushScan", 1, js_wifi_mesh_flush_scan),


    JS_CFUNC_DEF("status", 0, js_wifi_mesh_status),
    JS_CFUNC_DEF("watch", 1, js_wifi_mesh_watch),
    JS_CFUNC_DEF("cancel", 0, js_wifi_mesh_cancel),
    JS_PROP_END,
};
