99percentpeople/esp32qjs/components/esp32_mquickjs/src/core/mqjs_stdlib_esp32.c
static const JSClassDef js_wifi_mesh_class =
    JS_CLASS_DEF("WiFiMeshSession", 0, js_wifi_mesh_constructor,
        JS_CLASS_WIFI_MESH_SESSION, NULL, js_wifi_mesh_proto, NULL, js_wifi_mesh_finalizer);
static const JSPropDef js_wifi_mesh[] = {
    JS_CFUNC_DEF("capabilities", 0, js_wifi_mesh_capabilities),
    JS_CFUNC_DEF("open", 1, js_wifi_mesh_open),
    JS_PROP_END,
};
static const JSClassDef js_wifi_mesh_obj = JS_OBJECT_DEF("mesh", js_wifi_mesh);
#endif

static const JSPropDef js_wifi[] = {
#if ESP32_MQUICKJS_WIFI_MESH_AVAILABLE
    JS_PROP_CLASS_DEF("mesh", &js_wifi_mesh_obj),
#endif
#if CONFIG_ESP_WIFI_WAPI_PSK
    JS_PROP_CLASS_DEF("wapi", &js_wifi_wapi_obj),
#endif
    JS_PROP_CLASS_DEF("diagnostics", &js_wifi_diagnostics_obj),
#if CONFIG_ESP_WIFI_NAN_SYNC_ENABLE || CONFIG_ESP_WIFI_NAN_USD_ENABLE
    JS_PROP_CLASS_DEF("nan", &js_wifi_nan_obj),
#endif
#if CONFIG_ESP_NETIF_USES_TCPIP_WITH_BSD_API && CONFIG_LWIP_IPV4
    JS_PROP_CLASS_DEF("smartConfig", &js_wifi_smartconfig_obj),
    JS_PROP_CLASS_DEF("wps", &js_wifi_wps_obj),
#if CONFIG_ESP_WIFI_DPP_SUPPORT
    JS_PROP_CLASS_DEF("dpp", &js_wifi_dpp_obj),
#endif
#endif
#if CONFIG_SOC_WIFI_HE_SUPPORT && CONFIG_IDF_TARGET_ESP32C5
    JS_PROP_CLASS_DEF("twt", &js_wifi_twt_obj),
#endif
#if CONFIG_ESP_WIFI_ENTERPRISE_SUPPORT
    JS_PROP_CLASS_DEF("enterprise", &js_wifi_enterprise_obj),
#endif
#if CONFIG_ESP_WIFI_RRM_SUPPORT || CONFIG_ESP_WIFI_WNM_SUPPORT || CONFIG_ESP_WIFI_11R_SUPPORT
    JS_PROP_CLASS_DEF("roaming", &js_wifi_roaming_obj),
#endif
#if CONFIG_ESP_WIFI_FTM_ENABLE && (CONFIG_ESP_WIFI_FTM_INITIATOR_SUPPORT || (CONFIG_ESP_WIFI_FTM_RESPONDER_SUPPORT && CONFIG_ESP_WIFI_SOFTAP_SUPPORT))
    JS_PROP_CLASS_DEF("ftm", &js_wifi_ftm_obj),
#endif
    JS_PROP_CLASS_DEF("driver", &js_wifi_driver_obj),
    JS_PROP_CLASS_DEF("action", &js_wifi_action_obj),
    JS_PROP_CLASS_DEF("rawTx", &js_wifi_raw_tx_obj),
    JS_PROP_CLASS_DEF("vendorIe", &js_wifi_vendor_ie_obj),
    JS_PROP_CLASS_DEF("monitor", &js_wifi_monitor_obj),
    JS_CFUNC_DEF("capabilities", 0, js_wifi_capabilities),
    JS_CFUNC_DEF("watch", 1, js_wifi_watch),
    JS_CFUNC_DEF("acquireWakeLock", 0, js_wifi_acquire_wake_lock),
    JS_CFUNC_DEF("configure", 1, js_wifi_configure),
    JS_CFUNC_DEF("startAP", 1, js_wifi_start_ap),
    JS_CFUNC_DEF("stopAP", 1, js_wifi_stop_ap),
    JS_CFUNC_DEF("apClients", 1, js_wifi_ap_clients),
    JS_CFUNC_DEF("deauthClient", 1, js_wifi_deauth_client),
    JS_CFUNC_DEF("getMac", 1, js_wifi_get_mac),
    JS_CFUNC_DEF("setMac", 2, js_wifi_set_mac),
    JS_CFUNC_DEF("setCountry", 2, js_wifi_set_country),
    JS_CFUNC_DEF("setChannel", 2, js_wifi_set_channel),
    JS_CFUNC_DEF("start", 1, js_wifi_start),
    JS_CFUNC_DEF("stop", 1, js_wifi_stop),
    JS_CGETSET_DEF("DEFAULT_TIMEOUT_MS", js_wifi_get_default_timeout_ms, NULL),
    JS_CFUNC_DEF("connect", 2, js_wifi_connect),
    JS_CFUNC_DEF("disconnect", 1, js_wifi_disconnect),
    JS_CFUNC_DEF("setPowerSave", 1, js_wifi_set_power_save),
    JS_CFUNC_DEF("setTxPower", 1, js_wifi_set_tx_power),
    JS_CFUNC_DEF("status", 0, js_wifi_status),
    JS_CFUNC_DEF("scan", 1, js_wifi_scan),
#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI_CSI
    JS_PROP_CLASS_DEF("csi", &js_wifi_csi_obj),
#endif
    JS_PROP_END,
};

static const JSClassDef js_wifi_obj =
    JS_OBJECT_DEF("wifi", js_wifi);
#endif

#if CONFIG_ESP32_MQUICKJS_FEATURE_NET
static const JSPropDef js_net[] = {
    JS_CFUNC_DEF("status", 0, js_net_status),
    JS_CFUNC_DEF("watch", 0, js_net_watch),
    JS_PROP_END,
};

static const JSClassDef js_net_obj =
    JS_OBJECT_DEF("net", js_net);
#endif

#if CONFIG_ESP32_MQUICKJS_FEATURE_HTTP || CONFIG_ESP32_MQUICKJS_FEATURE_HTTP_SERVER
static const JSPropDef js_http[] = {
#if CONFIG_ESP32_MQUICKJS_FEATURE_HTTP
    JS_CGETSET_DEF("DEFAULT_TIMEOUT_MS", js_http_get_default_timeout_ms, NULL),
    JS_CGETSET_DEF("MAX_BODY_BYTES", js_http_get_max_body_bytes, NULL),
    JS_CFUNC_DEF("fetch", 2, js_http_fetch),
#endif
#if CONFIG_ESP32_MQUICKJS_FEATURE_HTTP_SERVER
    JS_CFUNC_DEF("server", 1, js_http_server_create),
#endif
    JS_PROP_END,
};

static const JSClassDef js_http_obj =
    JS_OBJECT_DEF("http", js_http);
#endif

#if CONFIG_ESP32_MQUICKJS_FEATURE_HTTP_SERVER
static const JSPropDef js_http_server_proto[] = {
    JS_CFUNC_DEF("start", 0, js_http_server_start),
    JS_CFUNC_DEF("stop", 0, js_http_server_stop),
    JS_CFUNC_DEF("close", 0, js_http_server_close),
    JS_CFUNC_DEF("receive", 1, js_http_server_receive),
    JS_CFUNC_DEF("stats", 0, js_http_server_stats),
    JS_CFUNC_DEF("route", 2, js_http_server_route),
    JS_CFUNC_DEF("respond", 2, js_http_server_respond),
    JS_CFUNC_DEF("removeRoute", 2, js_http_server_remove_route),
    JS_CFUNC_DEF("clearRoutes", 0, js_http_server_clear_routes),
    JS_PROP_END,
};

static const JSClassDef js_http_server_class =
    JS_CLASS_DEF("HttpServer", 0, js_http_server_constructor, JS_CLASS_HTTP_SERVER, NULL, js_http_server_proto, NULL, js_http_server_finalizer);
#endif

static const JSPropDef js_global_object_extra[] = {
    JS_PROP_CLASS_DEF("Headers", &js_headers_class),
    JS_PROP_CLASS_DEF("Request", &js_request_class),
    JS_PROP_CLASS_DEF("Response", &js_response_class),
    JS_PROP_CLASS_DEF("Future", &js_future_class),
    JS_PROP_CLASS_DEF("EventQueue", &js_event_queue_class),
    JS_PROP_CLASS_DEF("Stream", &js_stream_class),
    JS_PROP_CLASS_DEF("_ByteView", &js_byte_view_class),
    JS_PROP_CLASS_DEF("_ByteSpanSource", &js_byte_span_source_class),
#if CONFIG_ESP32_MQUICKJS_FEATURE_BITMAP
    JS_PROP_CLASS_DEF("_BitmapSpanSource", &js_bitmap_span_source_class),
    JS_PROP_CLASS_DEF("DisplayFont", &js_display_font_class),
    JS_PROP_CLASS_DEF("DisplayCommandBuffer", &js_display_command_buffer_class),
    JS_PROP_CLASS_DEF("Bitmap", &js_bitmap_class),
    JS_PROP_CLASS_DEF("bitmap", &js_bitmap_obj),
#endif
#if CONFIG_ESP32_MQUICKJS_FEATURE_FS
    JS_PROP_CLASS_DEF("fs", &js_fs_obj),
    JS_PROP_CLASS_DEF("framework", &js_framework_obj),
#endif
#if CONFIG_ESP32_MQUICKJS_FEATURE_NVS
    JS_PROP_CLASS_DEF("nvs", &js_nvs_obj),
#endif
#if CONFIG_ESP32_MQUICKJS_FEATURE_GPIO
    JS_PROP_CLASS_DEF("gpio", &js_gpio_obj),
#endif
#if CONFIG_ESP32_MQUICKJS_FEATURE_LEDC
    JS_PROP_CLASS_DEF("ledc", &js_ledc_obj),
#endif
#if CONFIG_ESP32_MQUICKJS_FEATURE_ADC
    JS_PROP_CLASS_DEF("adc", &js_adc_obj),
#endif
#if CONFIG_ESP32_MQUICKJS_FEATURE_DAC
    JS_PROP_CLASS_DEF("dac", &js_dac_obj),
#endif
    JS_PROP_CLASS_DEF("sys", &js_sys_obj),
#if CONFIG_ESP32_MQUICKJS_FEATURE_RPC
    JS_PROP_CLASS_DEF("rpc", &js_rpc_obj),
#endif
#if CONFIG_ESP32_MQUICKJS_FEATURE_RUNTIME_LOGS
    JS_PROP_CLASS_DEF("runtimeLogs", &js_runtime_logs_obj),
#endif
#if CONFIG_ESP32_MQUICKJS_FEATURE_I2C
    JS_PROP_CLASS_DEF("i2c", &js_i2c_obj),
    JS_PROP_CLASS_DEF("I2CBus", &js_i2c_bus_class),
    JS_PROP_CLASS_DEF("I2CDevice", &js_i2c_device_class),
#endif
#if CONFIG_ESP32_MQUICKJS_FEATURE_SPI
    JS_PROP_CLASS_DEF("spi", &js_spi_obj),
    JS_PROP_CLASS_DEF("SPIBus", &js_spi_bus_class),
    JS_PROP_CLASS_DEF("SPIDevice", &js_spi_device_class),
#endif
#if CONFIG_ESP32_MQUICKJS_FEATURE_UART
    JS_PROP_CLASS_DEF("uart", &js_uart_obj),
    JS_PROP_CLASS_DEF("UARTPort", &js_uart_port_class),
#endif
#if CONFIG_ESP32_MQUICKJS_FEATURE_RMT
    JS_PROP_CLASS_DEF("rmt", &js_rmt_obj),
    JS_PROP_CLASS_DEF("RMTSymbolBuffer", &js_rmt_symbol_buffer_class),
    JS_PROP_CLASS_DEF("RMTChannel", &js_rmt_channel_class),
#endif
#if CONFIG_ESP32_MQUICKJS_FEATURE_ESPNOW
    JS_PROP_CLASS_DEF("espNow", &js_espnow_obj),
    JS_PROP_CLASS_DEF("EspNowSession", &js_espnow_session_class),
    JS_PROP_CLASS_DEF("EspNowPeer", &js_espnow_peer_class),
#endif
#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI
    JS_PROP_CLASS_DEF("WiFiWakeLock", &js_wifi_wake_lock_class),
    JS_PROP_CLASS_DEF("WiFiMonitorSession", &js_wifi_monitor_session_class),
    JS_PROP_CLASS_DEF("WiFiMonitorFrame", &js_wifi_monitor_frame_class),
    JS_PROP_CLASS_DEF("WiFiMonitorBatch", &js_wifi_monitor_batch_class),
    JS_PROP_CLASS_DEF("WiFiRocSession", &js_wifi_roc_class),
#if ESP32_MQUICKJS_WIFI_MESH_AVAILABLE
    JS_PROP_CLASS_DEF("WiFiMeshSession", &js_wifi_mesh_class),
#endif
#if CONFIG_ESP_WIFI_NAN_SYNC_ENABLE || CONFIG_ESP_WIFI_NAN_USD_ENABLE
    JS_PROP_CLASS_DEF("WiFiNanSession", &js_wifi_nan_class),
    JS_PROP_CLASS_DEF("WiFiNanService", &js_wifi_nan_service_class),
#if CONFIG_ESP_WIFI_NAN_PAIRING
    JS_PROP_CLASS_DEF("WiFiNanPairing", &js_wifi_nan_pairing_class),
#endif
#if CONFIG_ESP_WIFI_NAN_SYNC_ENABLE
    JS_PROP_CLASS_DEF("WiFiNanDataPath", &js_wifi_nan_path_class),
#endif
#endif
#if CONFIG_ESP_WIFI_RRM_SUPPORT
    JS_PROP_CLASS_DEF("WiFiNeighborReportRequest", &js_wifi_neighbor_class),
#endif
#if CONFIG_ESP_WIFI_FTM_ENABLE && CONFIG_ESP_WIFI_FTM_INITIATOR_SUPPORT
    JS_PROP_CLASS_DEF("WiFiFtmSession", &js_wifi_ftm_class),
#endif
#if CONFIG_ESP_NETIF_USES_TCPIP_WITH_BSD_API && CONFIG_LWIP_IPV4
    JS_PROP_CLASS_DEF("WiFiSmartConfigSession", &js_wifi_smartconfig_class),
    JS_PROP_CLASS_DEF("WiFiWpsSession", &js_wifi_wps_class),
#if CONFIG_ESP_WIFI_DPP_SUPPORT
    JS_PROP_CLASS_DEF("WiFiDppSession", &js_wifi_dpp_class),
#endif
#if CONFIG_ESP_WIFI_WPS_SOFTAP_REGISTRAR
    JS_PROP_CLASS_DEF("WiFiWpsAPSession", &js_wifi_wps_ap_class),
#endif
#endif
#if CONFIG_SOC_WIFI_HE_SUPPORT && CONFIG_IDF_TARGET_ESP32C5
    JS_PROP_CLASS_DEF("WiFiTwtAgreement", &js_wifi_twt_agreement_class),
#endif
    JS_PROP_CLASS_DEF("WiFiRawTxSession", &js_wifi_raw_tx_session_class),
    JS_PROP_CLASS_DEF("WiFiRawPeriodicTx", &js_wifi_raw_periodic_class),
#endif
#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI_CSI
    JS_PROP_CLASS_DEF("WiFiCsiSession", &js_wifi_csi_session_class),
    JS_PROP_CLASS_DEF("WiFiCsiFrame", &js_wifi_csi_frame_class),
    JS_PROP_CLASS_DEF("WiFiCsiBatch", &js_wifi_csi_batch_class),
#endif
#if CONFIG_ESP32_MQUICKJS_FEATURE_BLE
    JS_PROP_CLASS_DEF("ble", &js_ble_obj),
    JS_PROP_CLASS_DEF("BLEAdapter", &js_ble_adapter_class),
    JS_PROP_CLASS_DEF("BLEScanner", &js_ble_scanner_class),
    JS_PROP_CLASS_DEF("BLEAdvertiser", &js_ble_advertiser_class),
    JS_PROP_CLASS_DEF("BLEConnection", &js_ble_connection_class),
    JS_PROP_CLASS_DEF("BLENotificationStream", &js_ble_notification_class),
    JS_PROP_CLASS_DEF("BLEGattServer", &js_ble_gatt_server_class),
    JS_PROP_CLASS_DEF("BLELocalCharacteristic", &js_ble_local_characteristic_class),
#endif
#if CONFIG_ESP32_MQUICKJS_FEATURE_I2S
    JS_PROP_CLASS_DEF("i2s", &js_i2s_obj),
    JS_PROP_CLASS_DEF("I2SChannel", &js_i2s_channel_class),
#endif
#if CONFIG_ESP32_MQUICKJS_FEATURE_CAMERA
    JS_PROP_CLASS_DEF("camera", &js_camera_obj),
    JS_PROP_CLASS_DEF("Camera", &js_camera_class),
    JS_PROP_CLASS_DEF("CameraFrame", &js_camera_frame_class),
#endif
#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI
    JS_PROP_CLASS_DEF("wifi", &js_wifi_obj),
#endif
#if CONFIG_ESP32_MQUICKJS_FEATURE_NET
    JS_PROP_CLASS_DEF("net", &js_net_obj),
#endif
#if CONFIG_ESP32_MQUICKJS_FEATURE_USB_SERIAL
    JS_PROP_CLASS_DEF("usbSerial", &js_usb_serial_obj),
    JS_PROP_CLASS_DEF("USBSerialHandle", &js_usb_serial_handle_class),
#endif
#if CONFIG_ESP32_MQUICKJS_FEATURE_SOCKET
    JS_PROP_CLASS_DEF("socket", &js_socket_obj),
#endif
#if CONFIG_ESP32_MQUICKJS_FEATURE_WEBSOCKET
    JS_PROP_CLASS_DEF("websocketClient", &js_websocket_client_obj),
    JS_PROP_CLASS_DEF("WebSocketClientHandle", &js_websocket_handle_class),
#endif
#if CONFIG_ESP32_MQUICKJS_FEATURE_HTTP || CONFIG_ESP32_MQUICKJS_FEATURE_HTTP_SERVER
    JS_PROP_CLASS_DEF("http", &js_http_obj),
#endif
#if CONFIG_ESP32_MQUICKJS_FEATURE_HTTP_SERVER
    JS_PROP_CLASS_DEF("HttpServer", &js_http_server_class),
#endif
#if CONFIG_ESP32_MQUICKJS_FEATURE_SOCKET
    JS_PROP_CLASS_DEF("TCPSocket", &js_tcp_socket_class),
    JS_PROP_CLASS_DEF("TCPListener", &js_tcp_listener_class),
    JS_PROP_CLASS_DEF("UDPSocket", &js_udp_socket_class),
#endif
#if CONFIG_ESP32_MQUICKJS_FEATURE_RPC
    JS_PROP_CLASS_DEF("RPCCodec", &js_rpc_codec_class),
    JS_PROP_CLASS_DEF("RPCDecoder", &js_rpc_decoder_class),
#endif
    JS_CFUNC_DEF("help", 0, js_help),
    JS_CFUNC_DEF("sleep", 1, js_sleep),
    JS_CFUNC_DEF("setInterval", 2, js_setInterval),
    JS_CFUNC_DEF("clearInterval", 1, js_clearTimeout),
    JS_PROP_END,
};

static size_t count_prop_defs(const JSPropDef *defs)
{
    size_t count = 0;

    while (defs[count].def_type != JS_DEF_END) {
        count++;
    }
    return count;
}

static JSPropDef *merge_prop_defs(const JSPropDef *base_defs, const JSPropDef *extra_defs)
{
    size_t base_count = count_prop_defs(base_defs);
    size_t extra_count = count_prop_defs(extra_defs);
    JSPropDef *merged = malloc(sizeof(*merged) * (base_count + extra_count + 1));

    if (merged == NULL) {
        return NULL;
    }
    memcpy(merged, base_defs, sizeof(*merged) * base_count);
    memcpy(merged + base_count, extra_defs, sizeof(*merged) * extra_count);
    merged[base_count + extra_count] = (JSPropDef)JS_PROP_END;
    return merged;
}

int main(int argc, char **argv)
{
    JSPropDef *merged_global_object = merge_prop_defs(js_global_object_base, js_global_object_extra);
    int ret;

    if (merged_global_object == NULL) {
        fprintf(stderr, "out of memory while merging stdlib globals\n");
        return 1;
    }
    ret = build_atoms("js_stdlib", merged_global_object, js_c_function_decl_base, argc, argv);
    free(merged_global_object);
    return ret;
}
